const quizesSets = [
    {
        id: "moneybanks001",
        type: "multiplechoices",
        header: "Тест",
        title: "Факторы производства",
        theme: "Деньги и банковская система",
        text: "Что из перечисленного НЕ относится к факторам производства?",
        choices: [
            "труд",
            "земля",
            "деньги",
            "капитал",
            "предпринимательские способности"
        ],
        answers: ["деньги"]
    },


    {
        id: "moneybanks002",
        type: "multiplechoices",
        header: "Тест",
        title: "Функции денег 1",
        theme: "Деньги и банковская система",
        text: "Деньги, как средство обращения пришли на смену",
        choices: [
            "сбережениям",
            "прибыли",
            "доходы",
            "бартер"
        ],
        answers: ["бартер"]
    },

    {
        id: "moneybanks003",
        type: "multiplechoices",
        header: "Тест",
        title: "Функции денег 2",
        theme: "Деньги и банковская система",
        text: "Когда приходится решать, сколько денег нужно иметь, чтобы купить товар, то деньги выступают в функции",
        choices: [
            "мера стоимости",
            "средство платежа",
            "средство обращения",
            "средство накопления"

        ],
        answers: ["мера стоимости"]
    },

   
    {
        id: "moneybanks004",
        type: "multiplechoices",
        header: "Тест",
        title: "Функции денег 3",
        theme: "Деньги и банковская система",
        text: "Сумма денег, которая уплачивается при покупке товаров или услуг это",
        choices: [
            "цена",
            "стоимость",
            "зарплата",
            "процент"

        ],
        answers: ["цена"]
    },

    {
        id: "moneybanks005",
        type: "multiplechoices",
        header: "Тест",
        title: "Функции денег 5",
        theme: "Деньги и банковская система",
        text: "Нечто равноценное и соответствующее в определенном отношении другому товару это",
        choices: [
            "эквивалент",
            "деньги",
            "прибыль",
            "товар"

        ],
        answers: ["эквивалент"]
    },

    {
        id: "moneybanks006",
        type: "multiplechoices",
        header: "Тест",
        title: "Функции денег 6",
        theme: "Деньги и банковская система",
        text: "Когда необходимо передать деньги из рук в руки, то выполняется функция денег как",
        choices: [
            "средство накопления",
            "средство обращения",
            "средство платежа",
            "мировые деньги"

        ],
        answers: ["средство обращения"]
    },

    {
        id: "moneybanks007",
        type: "multiplechoices",
        header: "Тест",
        title: "Функции денег 7",
        theme: "Деньги и банковская система",
        text: "Когда необходимо передать деньги из рук в руки, то выполняется функция денег",
        choices: [
            "средство накопления",
            "средство обращения",
            "средство платежа",
            "мировые деньги"

        ],
        answers: ["средство обращения"]
    },

    {
        id: "moneybanks008",
        type: "multiplechoices",
        header: "Тест",
        title: "Функции денег 8",
        theme: "Деньги и банковская система",
        text: "При получении работником зарплаты деньги выступают как",
        choices: [
            "мера стоимости",
            "средство накопления",
            "средство платежа",
            "средство обращения"

        ],
        answers: ["средство платежа"]
    },

   
    {
        id: "moneybanks009",
        type: "multiplechoices",
        header: "Тест",
        title: "Функции денег 10",
        theme: "Деньги и банковская система",
        text: "Работник каждый месяц откладывает деньги в банк, чтобы летом поехать в отпуск. В данном случае проявляется функция денег как …",
        choices: [
            "мера стоимости",
            "средство накопления",
            "средство платежа",
            "средство обращения"

        ],
        answers: ["средство накопления"]
    },



    {
        id: "moneybanks010",
        type: "multiplechoices",
        header: "Тест",
        title: "Банковская система",
        theme: "Деньги и банковская система",
        text: "В России банковская система является двухуровневой. Верхний уровень занимает …, а нижний – коммерческие банки",
        choices: [
            "Центральный банк РФ",
            "Всемирный банк",
            "Банк экономики и развития",
            "Сбербанк"

        ],
        answers: ["Центральный банк РФ"]
    },


    {
        id: "moneybanks011",
        type: "multiplechoices",
        header: "Тест",
        title: "Банковская система 2",
        theme: "Деньги и банковская система",
        text: "Коммерческие банки в России",
        choices: [
            "осуществляют контроль над денежной массой в стране",
            "привлекают свободные денежные средства и размещают их в форме ссуд",
            "используют средства пенсионных фондов",
            "занимаются эмиссией денег"

        ],
        answers: ["привлекают свободные денежные средства и размещают их в форме ссуд"]
    },



    {
        id: "moneybanks012",
        type: "multiplechoices",
        header: "Тест",
        title: "Банковская система 3",
        theme: "Деньги и банковская система",
        text: "Пассивные операции",
        choices: [
            "по привлечению денег (приём вкладов, получение кредитов у ЦБ, выпуск ценных бумаг)",
            "по размещению денежных средств (предоставление кредитов)"           

        ],
        answers: ["по привлечению денег (приём вкладов, получение кредитов у ЦБ, выпуск ценных бумаг)"]
    },

    {
        id: "moneybanks013",
        type: "multiplechoices",
        header: "Тест",
        title: "Банковская система 4",
        theme: "Деньги и банковская система",
        text: "Пассивные операции",
        choices: [
            "по привлечению денег (приём вкладов, получение кредитов у ЦБ, выпуск ценных бумаг)",
            "по размещению денежных средств (предоставление кредитов)"           

        ],
        answers: ["по размещению денежных средств (предоставление кредитов)" ]
    },


    {
        id: "moneybanks014",
        type: "multiplechoices",
        header: "Тест",
        title: "Банковские счета 1",
        theme: "Деньги и банковская система",
        text: "Счета клиентов в коммерческом банке это",
        choices: [
            "расчетные счета",
            "корреспондентские счета"           

        ],
        answers: ["расчетные счета"]
    },

    {
        id: "moneybanks015",
        type: "multiplechoices",
        header: "Тест",
        title: "Банковские счета 2",
        theme: "Деньги и банковская система",
        text: "Счета коммерческого банка в Центральном банке это",
        choices: [
            "расчетные счета",
            "корреспондентские счета" 
        ],
        answers: ["корреспондентские счета" ]
    },

       {
        id: "moneybanks016",
        type: "multiplechoices",
        header: "Тест",
        title: "Учетная ставка",
        theme: "Деньги и банковская система",
        text: "Термин «учетная ставка» означает",
        choices: [
            "уровень снижения цены для Центрального банка, когда он скупает государственные ценные бумаги",
            "степень давления, оказываемого Центральным банком на коммерческие банки с целью снижения объема выдаваемых им ссуд",
            "процентную ставку по ссудам, предоставляемым коммерческим банкам",
            "степень воздействия Центрального банка на рост денежной массы и объема ВВП"
        ],
        answers: ["процентную ставку по ссудам, предоставляемым коммерческим банкам"]
    },

    {
        id: "moneybanks017",
        type: "multiplechoices",
        header: "Тест",
        title: "Продажа ценных бумаг",
        theme: "Деньги и банковская система",
        text: "Если Центральный банк продает большое количество государственных ценных бумаг на открытом рынке, то он преследует при этом цель",
        choices: [
            "снизить учетную ставку",
            "сделать кредит менее доступным",
            "сделать кредит более доступным"            
        ],
        answers: ["сделать кредит менее доступным"]
    },




    











    // {
    //     id: "economics0103",
    //     type: "multiplechoices",
    //     header: "Тест",
    //     title: "Базовые понятия экономики",
    //     theme: "Экономика 1",
    //     text: "… – это способность блага удовлетворять потребности человека",
    //     choices: [
    //         "полезность",
    //         "потребность",
    //         "желания",
    //         "инвестиции"
    //     ],
    //     answers: ["полезность"]
    // },

    // {
    //     id: "economics0104",
    //     header: "Тест",
    //     type: "multiplechoices",
    //     title: "Пирамида Маслоу",
    //     theme: "Экономика 1",
    //     text: "К способам удовлетворения базовых потребностей человека относится",
    //     choices: [
    //         "обучение в школе",
    //         "чтение газет",
    //         "ужин в ресторане",
    //         "работа"
    //     ],
    //     answers: ["ужин в ресторане"]
    // },

    // {
    //     id: "economics0105",
    //     header: "Тест",
    //     type: "multiplechoices",
    //     title: "Экономические системы 1",
    //     theme: "Экономика 1",
    //     text: "В какой экономической системе главные вопросы экономики решаются в соответствии со сложившимися традициями?",
    //     choices: [
    //         "Традиционной",
    //         "Рыночной",
    //         "Централизованной (командной)"
    //     ],
    //     answers: ["Традиционной"]
    // },

    // {
    //     id: "economics0106",
    //     header: "Тест",
    //     type: "multiplechoices",
    //     title: "Экономические системы 2",
    //     theme: "Экономика 1",
    //     text: "В какой экономической системе главные вопросы экономики решаются на основе свободного ценообразования, конкуренции и частной собственности?",
    //     choices: [
    //         "Традиционной",
    //         "Рыночной",
    //         "Централизованной (командной)"
    //     ],
    //     answers: ["Рыночной"]
    // },

    // {
    //     id: "economics0107",
    //     type: "multiplechoices",
    //     header: "Тест",
    //     title: "Экономические системы 3",
    //     theme: "Экономика 1",
    //     text: "В какой экономической системе главные вопросы экономики решаются директивно со стороны государства?",
    //     choices: [
    //         "Традиционной",
    //         "Рыночной",
    //         "Централизованной (командной)"
    //     ],
    //     answers: ["Централизованной (командной)"]
    // },

    // {
    //     id: "economics0108",
    //     type: "multiplechoices",
    //     header: "Тест",
    //     title: "Равновесие на рынке 1",
    //     theme: "Экономика 2",
    //     text: "… – это желание и возможность покупателя купить определенный товар или услугу в данном месте и в данное время",
    //     choices: [
    //         "Спрос",
    //         "Предложение",
    //         "Эластичность"
    //     ],
    //     answers: ["Спрос"]
    // },

    // {
    //     id: "economics0109",
    //     type: "multiplechoices",
    //     header: "Тест",
    //     title: "Величина спроса",
    //     theme: "Экономика 2",
    //     text: "Какие из перечисленных факторов не влияют на величину спроса?",
    //     choices: [
    //         "цена",
    //         "доходы населения",
    //         "сезон",
    //         "потребительские ожидания",
    //         "на величину спроса влияют все перечисленные факторы"
    //     ],
    //     answers: ["на величину спроса влияют все перечисленные факторы"]
    // },

    // {
    //     id: "economics0110",
    //     type: "multiplechoices",
    //     header: "Тест",
    //     title: "Равновесие на рынке 2",
    //     theme: "Экономика 2",
    //     text: " … – готовность продавца продать определенный товар или услугу по определенной цене в данный момент времени в данном месте.",
    //     choices: [
    //         "Спрос",
    //         "Предложение",
    //         "Эластичность"
    //     ],
    //     answers: ["Предложение"]
    // },

  




]



export default quizesSets
