let balanceformArray = [

    {
        id: 100,
        name: "1. Денежные средства",
        type: "asset"
    },

    {
        id: 200,
        name: "2. Средства кредитной организации в Центральном банке Российской Федерации",
        type: "asset"
    },

    {
        id: 300,
        name: "3. Средства в кредитных организациях",
        type: "asset"
    },

    {
        id: 400,
        name: "4. Финансовые активы, оцениваемые по справедливой стоимости через прибыль или убыток",
        type: "asset"
    },

    {
        id: 500,
        name: "5. Чистая ссудная задолженность, оцениваемая по амортизированной стоимости",
        type: "asset"
    },

    {
        id: 600,
        name: "6. Чистые вложения в финансовые активы, оцениваемые по справедливой стоимости через прочий совокупный доход",
        type: "asset"
    },

    {
        id: 700,
        name: "7. Чистые вложения в ценные бумаги и иные финансовые активы, оцениваемые по амортизированной стоимости (кроме ссудной задолженности)",
        type: "asset"
    },

    {
        id: 800,
        name: "8. Инвестиции в дочерние и зависимые организации",
        type: "asset"
    },

    {
        id: 900,
        name: "9. Требования по текущему налогу на прибыль",
        type: "asset"
    },

    {
        id: 1000,
        name: "10. Отложенный налоговый актив",
        type: "asset"
    },

    {
        id: 1100,
        name: "11. Основные средства, активы в форме права пользования и нематериальные активы",
        type: "asset"
    },

    {
        id: 1200,
        name: "12. Долгосрочные активы, предназначенные для продажи",
        type: "asset"
    },

    {
        id: 1300,
        name: "13. Прочие активы",
        type: "asset"
    },

    {
        id: 1500,
        name: "Кредиты, депозиты и прочие средства Центрального банка Российской Федерации",
        type: "liability"
    },
    {
        id: 1610,
        name: "16.1 Cредства кредитных организаций",
        type: "liability"
    },
    {
        id: 1620,
        name: "16.1 Cредства клиентов, не являющихся кредитными организациями",
        type: "liability"
    },

    {
        id: 1621,
        name: "16.2.1 В т.ч. средства физических лиц, в том числе индивидуальных предпринимателей",
        type: "liability"
    },

        {
        id: 1700,
        name: "17. Финансовые обязательства, оцениваемые по справедливой стоимости через прибыль или убыток",
        type: "liability"
    },

    {
        id: 1800,
        name: "18. Выпущенные долговые ценные бумаги",
        type: "liability"
    },

    {
        id: 1900,
        name: "19. Привлеченные субординированные кредиты (депозиты, займы) и выпущенные субординированные облигационные займы, классифицированные в качестве обязательств",
        type: "liability"
    },

    {
        id: 2000,
        name: "20. Обязательства по текущему налогу на прибыль",
        type: "liability"
    },

    {
        id: 2100,
        name: "21. Отложенные налоговые обязательства",
        type: "liability"
    },

    {
        id: 2200,
        name: "22. Прочие обязательства",
        type: "liability"
    },

    {
        id: 2300,
        name: "23. Резервы на возможные потери по условным обязательствам кредитного характера, прочим возможным потерям и операциям с резидентами офшорных зон",
        type: "liability"
    },


    {
        id: 2500,
        name: "25. Средства акционеров (участников)", type: "equity"
    },

    {
        id: 2600,
        name: "26. Собственные акции (доли), выкупленные у акционеров (участников)", type: "equity"
    },

    {
        id: 2700,
        name: "27. Эмиссионный доход", type: "equity"
    },

    {
        id: 2800,
        name: "28. Резервный фонд", type: "equity"
    },

    {
        id: 2900,
        name: "29. Переоценка финансовых активов, оцениваемых по справедливой стоимости через прочий совокупный доход, уменьшенная на отложенное налоговое обязательство (увеличенная на отложенный налоговый актив)",
        type: "equity"
    },

    {
        id: 3000,
        name: "30. Переоценка основных средств, активов в форме права пользования и нематериальных активов, уменьшенная на отложенное налоговое обязательство",
        type: "equity"
    },

    {
        id: 3100,
        name: "31. Переоценка обязательств (требований) по выплате долгосрочных вознаграждений",
        type: "equity"
    },

    {
        id: 3200,
        name: "32. Переоценка инструментов хеджирования",
        type: "equity"
    },

    {
        id: 3300,
        name: "33. Денежные средства безвозмездного финансирования (вклады в имущество)",
        type: "equity"
    },

    {
        id: 3400,
        name: "34. Изменение справедливой стоимости финансового обязательства, обусловленное изменением кредитного риска",
        type: "equity"
    },

    {
        id: 3500,
        name: "35. Привлеченные субординированные кредиты (депозиты, займы) и выпущенные субординированные облигационные займы, классифицированные в качестве долевых инструментов",
        type: "equity"
    },

    {
        id: 3600,
        name: "36. Оценочные резервы под ожидаемые кредитные убытки",
        type: "equity"
    },

    {
        id: 3700,
        name: "37. Неиспользованная прибыль (убыток)",
        type: "equity"
    },



]

export default balanceformArray