const accounting101 = [
  // {
  //     id: "assetscasedemo", type: "accountingwithtasks", title: "Кейс Имущество Демо", 
  //     theme: "Бухгалтерский учет имущества коммерческой организации"

  // },
  // {
  //     id: "assetscase", type: "accountingwithtasks", title: "Кейс Имущество Контрольный",
  //     theme: "Бухгалтерский учет имущества коммерческой организации"
  // },
  // {
  //     id: "paymentscasedemo", type: "accountingwithtasks", title: "Кейс Расчеты Демо",
  //     theme: "Бухгалтерский учет расчетных операций и капитала коммерческой организации"
  // },
  // {
  //     id: "paymentscase", type: "accountingwithtasks", title: "Кейс Расчеты Контрольный",
  //     theme: "Бухгалтерский учет расчетных операций и капитала коммерческой организации"
  // },
  // {
  //     id: "productioncasedemo", type: "accountingwithtasks", title: "Кейс Производство и продажа Демо",
  //     theme: "Бухгалтерский учет производства и реализации продукции коммерческой организации"
  // },
  // {
  //     id: "productioncase", type: "accountingwithtasks", title: "Кейс Производство и продажа Контрольный",
  //     theme: "Бухгалтерский учет производства и реализации продукции коммерческой организации"
  // },

  // {
  //   id: "finreportscasedemo", title: "Кейс Бухотчетность Демо", //type: "accountingwithtasks",
  //   theme: "Состав и составление бухгалтерской (финансовой) отчетности коммерческой организации",
  //   text: "Отразите в бухгалтерском учете хозяйственные операции",
  //   type: "accountingwithprofitscash",
  //   tasks: [
  //     {
  //       id: 1, text: "Дек 2024 Сформирован уставный капитал 100 000",
  //       accountingReportsForBookEntry: ["7580"]
  //     },
  //     {
  //       id: 2, text: "Дек 2024 Учредитель внес деньги на расчетный счет 100 000",
  //       accountingReportsForBookEntry: ["5175"]
  //     },
  //     {
  //       id: 3, text: "Январь 2025 Приобретены товары на сумму 60 000, в том числе НДС 20%",
  //       accountingReportsForBookEntry: ["4160", "1960"]
  //     },
  //     {
  //       id: 4, text: "Январь 2025 Продано 80% товаров на сумму 120 000, в том числе НДС 20%",
  //       accountingReportsForBookEntry: ["6290", "9068", "9041"]
  //     },
  //     {
  //       id: 5, text: "Январь 2025 Начислена заработная плата сотрудникам торговой организации 20 000",
  //       accountingReportsForBookEntry: ["4470"]
  //     },
  //     {
  //       id: 6, text: "Январь 2025 Отчисления на социальные нужды по сотрудникам торговой организации 10 000",
  //       accountingReportsForBookEntry: ["4469"]
  //     },
  //   ],

  // },

  // {
  //   id: "finresultscasedemo", title: "Кейс Финанрезультаты Демо", //type: "accountingwithtasks"
  //   theme: "Бухгалтерский учет финансовых результатов деятельности коммерческой организации",
  //   text: "Отразите в бухгалтерском учете хозяйственные операции",
  //   type: "accountingwithprofitscash",
  //   tasks: [
  //     {
  //       id: 1, text: "Дек 2024 Сформирован уставный капитал 100 000",
  //       accountingReportsForBookEntry: ["7580"]
  //     },
  //     {
  //       id: 2, text: "Дек 2024 Учредитель внес деньги на расчетный счет 100 000",
  //       accountingReportsForBookEntry: ["5175"]
  //     },
  //     {
  //       id: 3, text: "Январь 2025 Приобретены товары на сумму 60 000, в том числе НДС 20%",
  //       accountingReportsForBookEntry: ["4160", "1960"]
  //     },
  //     {
  //       id: 4, text: "Январь 2025 Продано 80% товаров на сумму 120 000, в том числе НДС 20%",
  //       accountingReportsForBookEntry: ["6290", "9068", "9041"]
  //     },
  //     {
  //       id: 5, text: "Январь 2025 Начислена заработная плата сотрудникам торговой организации 20 000",
  //       accountingReportsForBookEntry: ["4470"]
  //     },
  //     {
  //       id: 6, text: "Январь 2025 Отчисления на социальные нужды по сотрудникам торговой организации 10 000",
  //       accountingReportsForBookEntry: ["4469"]
  //     },
  //   ],
  // },

  // {
  //   id: "finresultscase", title: "Кейс Финанрезультаты Контрольный",
  //   //  type: "accountingwithtasks",
  //   theme: "Бухгалтерский учет финансовых результатов деятельности коммерческой организации",
  //   text: "Отразите в бухгалтерском учете хозяйственные операции",
  //   type: "accountingwithprofitscash",
  //   tasks: [
  //     { id: 1, text: "Дек 2024 Сформирован уставный капитал {=400+{var1-10}*10}" },
  //     { id: 2, text: "Дек 2024 Учредитель внес деньги на расчетный счет {=400+{var1-10}*10}" },
  //     { id: 3, text: "Январь 2025 Приобретены товары на сумму {=400+{var1-10}*10}, в том числе НДС 20%" },
  //     { id: 4, text: "Январь 2025 Продано 80% товаров на сумму {=400+{var1-10}*10}, в том числе НДС 20%" },
  //     { id: 5, text: "Январь 2025 Начислена заработная плата сотрудникам торговой организации {=400+{var1-10}*10}" },
  //     { id: 6, text: "Январь 2025 Отчисления на социальные нужды по сотрудникам торговой организации {=400+{var1-10}*10}" }]
  // },




  // {
  //     id: "finreportscase", type: "accountingwithtasks", title: "Кейс Бухотчетность Контрольный",
  //     theme: "Состав и составление бухгалтерской (финансовой) отчетности коммерческой организации",
  // text: "Отразите в бухгалтерском учете хозяйственные операции",
  // },

  {
    id: "taxescasedemo", title: "Кейс Налоги Демо",
    theme: "Налоговый учет, налоговые расчеты и налоговое планирование в коммерческой организации",
    text: "Отразите в бухгалтерском учете хозяйственные операции",
    type: "accountingwithprofitscash",
    tasks: [
      {
        id: 1, text: "Дек 2024 Сформирован уставный капитал 100 000",
        accountingReportsForBookEntry: ["7580"]
      },
      {
        id: 2, text: "Дек 2024 Учредитель внес деньги на расчетный счет 100 000",
        accountingReportsForBookEntry: ["5175"]
      },
      {
        id: 3, text: "Январь 2025 Приобретены товары на сумму 60 000, в том числе НДС 20%",
        accountingReportsForBookEntry: ["4160", "1960"]
      },
      {
        id: 4, text: "Январь 2025 Продано 80% товаров на сумму 120 000, в том числе НДС 20%",
        accountingReportsForBookEntry: ["6290", "9068", "9041"]
      },
      {
        id: 5, text: "Январь 2025 Начислена заработная плата сотрудникам торговой организации 20 000",
        accountingReportsForBookEntry: ["4470"]
      },
      {
        id: 6, text: "Январь 2025 Отчисления на социальные нужды по сотрудникам торговой организации 10 000",
        accountingReportsForBookEntry: ["4469"]
      },
    ],
  },
  {
    id: "taxescase", type: "accountingwithtasks", title: "Кейс Налоги Контрольный",
    theme: "Налоговый учет, налоговые расчеты и налоговое планирование в коммерческой организации",
    text: "Отразите в бухгалтерском учете хозяйственные операции",
    type: "accountingwithprofitscash",
    tasks: [
      { id: 1, text: "Дек 2024 Сформирован уставный капитал {=400+{var1-10}*10}" },
      { id: 2, text: "Дек 2024 Учредитель внес деньги на расчетный счет {=400+{var1-10}*10}" },
      { id: 3, text: "Январь 2025 Приобретены товары на сумму {=400+{var1-10}*10}, в том числе НДС 20%" },
      { id: 4, text: "Январь 2025 Продано 80% товаров на сумму {=400+{var1-10}*10}, в том числе НДС 20%" },
      { id: 5, text: "Январь 2025 Начислена заработная плата сотрудникам торговой организации {=400+{var1-10}*10}" },
      { id: 6, text: "Январь 2025 Отчисления на социальные нужды по сотрудникам торговой организации {=400+{var1-10}*10}" }]
  },

  // {
  //     id: "audiocasedemo", type: "accountingwithtasks", title: "Кейс Контроль Демо",
  //     theme: "Внутренний контроль ведения бухгалтерского учета и составления бухгалтерской (финансовой) отчетности коммерческой организации",
  //text: "Отразите в бухгалтерском учете хозяйственные операции",
  // },
  // {
  //     id: "audiocase", type: "accountingwithtasks", title: "Кейс Контроль Контрольный",
  //text: "Отразите в бухгалтерском учете хозяйственные операции",
  //     theme: "Внутренний контроль ведения бухгалтерского учета и составления бухгалтерской (финансовой) отчетности коммерческой организации"
  // },



];


const statistics = [


  {
    id: "statistics105", type: "multiplechoices", header: "Тест", title: "Статистика", theme: "Введение в статистику",
    text: "Статистика – это наука, которая изучает",
    choices: ["структуру природных и общественных явлений и процессов", "процессы накопления и использования богатств общества", "закономерности социально-экономических массовых явлений и процессов численными методами", "процесс потребления благ"],
    answers: ["закономерности социально-экономических массовых явлений и процессов численными методами"]
  },


  {
    id: "statistics110",
    type: "multiplechoices",
    header: "Тест",
    title: "Объект статистического наблюдения",
    theme: "Введение в статистику",
    text: "Объект статистического наблюдения - это...",
    choices: ["единица наблюдения", "статистическая совокупность", "единица статистической совокупности", "совокупность признаков изучаемого явления"],
    answers: ["статистическая совокупность"]
  },
  {
    id: "statistics115", type: "multiplechoices", header: "Тест", title: "Предмет изучения статистики", theme: "Введение в статистику",
    text: "Предметом изучения статистики являются",
    choices: ["результаты статистического наблюдения, сводки и группировки", "закономерности социально-экономических массовых явлений и процессов на предприятиях и в экономике в целом", "закономерности маркетинговой деятельности предприятий", "процессы развития общества"],
    answers: ["закономерности социально-экономических массовых явлений и процессов на предприятиях и в экономике в целом"]
  },


  {
    id: "statistics120",
    type: "multiplechoices",
    header: "Тест",
    title: "Центральный орган государственной статистики России",
    theme: "Основы",
    text: "Центральный орган государственной статистики России",
    choices: [
      "статистическое управление города Москвы",
      "различные документы",
      "Центральное статистическое управление РФ",
      "Комитет статистических данных",
      "Росстат РФ"
    ]
    ,
    answers: ["Росстат РФ"]
  },

  {
    id: "statistics205",
    type: "multiplechoices",
    header: "Тест",
    title: "Этапы статистического наблюдения",
    theme: "Введение в статистику",
    text: "– первый и исходный этап статистического исследования",
    choices: ["Статистическое наблюдение", "Регистры", "Статистический график", "Размах вариации", "Статистическая таблица"],
    answers: ["Статистическое наблюдение"]
  },

  {
    id: "statistics210",
    type: "multiplechoices",
    header: "Тест",
    title: "Формы статистического наблюдения",
    theme: "Введение в статистику",
    text: "– форма наблюдения, при которой факты состояния отдельных единиц совокупности непрерывно регистрируются",
    choices: ["Статистическое наблюдение", "Регистры", "Статистический график", "Размах вариации", "Статистическая таблица"],
    answers: ["Регистры"]
  },


  {
    id: "statistics215",
    type: "multiplechoices",
    header: "Тест",
    title: "По времени регистрации фактов",
    theme: "Основы",
    text: "По времени регистрации фактов статистическое наблюдение бывает",
    choices: [
      "единовременное",
      "специально организованное",
      "выборочное",
      "непосредственное"],
    answers: ["единовременное"]
  },


  {
    id: "statistics220",
    type: "multiplechoices",
    header: "Тест",
    title: "По охвату единиц совокупности",
    theme: "Основы",
    text: "По охвату единиц совокупности статистическое наблюдение бывает",
    choices: [
      "монографическое",
      "периодическое",
      "в виде отчетности",
      "документальное"]
    ,
    answers: ["монографическое"]
  },


  {
    id: "statistics225",
    type: "multiplechoices",
    header: "Тест",
    title: "Метод основного массива",
    theme: "Основы",
    text: "При методе основного массива обследованию подвергаются",
    choices: [
      "самые существенные, наиболее крупные единицы совокупности, имеющие по основному признаку наибольший удельный вес в совокупности",
      "все единицы совокупности",
      "самые существенные, наиболее мелкие единицы совокупности, имеющие по основному признаку наименьший удельный вес в совокупности",
      "отдельные единицы совокупности, представители новых типов явлений"]
    ,
    answers: ["самые существенные, наиболее крупные единицы совокупности, имеющие по основному признаку наибольший удельный вес в совокупности"]
  },


  {
    id: "statistics230",
    type: "multiplechoices",
    header: "Тест",
    title: "Опрос предполагает",
    theme: "Основы",
    text: "Опрос предполагает использование в качестве источника информации",
    choices: [
      "анкеты",
      "слова респондентов",
      "различные документы",
      "штат добровольных корреспондентов",
      "отдельные единицы совокупности, представители новых типов явлений"]
    ,
    answers: ["анкеты"]
  },

  {
    id: "statistics235",
    type: "multiplechoices",
    header: "Тест",
    title: "Процесс сбора первичных данных",
    theme: "Основы",
    text: "Процесс сбора первичных данных о социальных и экономических процессах, организуемый на научной основе систематически и планомерно, это",
    choices: [
      "статистическое наблюдение",
      "статистическое планирование",
      "статистическое содержание",
      "статистическое прогнозирование"]
    ,
    answers: ["статистическое наблюдение"]
  },


  {
    id: "statistics240",
    type: "multiplechoices",
    header: "Тест",
    title: "Наблюдение, при котором ответы человека на вопросы фиксируются",
    theme: "Основы",
    text: "Наблюдение, при котором ответы человека на вопросы фиксируются на определенном формуляре",
    choices: [
      "опрос",
      "допрос",
      "донос",
      "прогноз",
      "статистическое наблюдение"
    ]
    ,
    answers: ["статистическое наблюдение"]
  },

  {
    id: "statistics245",
    type: "multiplechoices",
    header: "Тест",
    title: "Сведения о своей деятельности в виде  обязательных отчетов",
    theme: "Основы",
    text: "Форма, при которой организации представляют в органы статистики сведения о своей деятельности в виде  обязательных отчетов по специально утвержденным показателям, в установленные  сроки",
    choices: [
      "отчетность",
      "документ",
      "формуляр",
      "шаблон"]
    ,
    answers: ["отчетность"]
  },

  { id: "statistics305", type: "multiplechoices", header: "Тест", title: "Сводка", theme: "Введение в статистику", text: "Сводкой в статистическом наблюдении называется", choices: ["объединение единиц совокупности в некоторые группы, имеющие свои характерные особенности, общие черты и сходные изучаемого признака", "особая стадия статистического исследования, в ходе которого систематизируются первичные материалы стратегического наблюдения", "объект, характеризующийся цифрами", "обобщение единичных факторов"], answers: ["особая стадия статистического исследования, в ходе которого систематизируются первичные материалы стратегического наблюдения"] },

  {
    id: "statistics310",
    type: "multiplechoices",
    header: "Тест",
    title: "Ряды распределения вариационные",
    theme: "Основы",
    text: "Ряды распределения называют вариационными, если они",
    choices: [
      "построены по количественному признаку",
      "остроены по качественному признаку",
      "построены в порядке убывания",
      "построены в порядке возрастания"],
    answers: ["построены по количественному признаку"]
  },


  {
    id: "statistics405",
    type: "multiplechoices",
    header: "Тест",
    title: "Система упорядоченных горизонтальных строк и вертикальных столбцов",
    theme: "Основы",
    text: "Система упорядоченных горизонтальных строк и вертикальных столбцов, в которой записываются статистические данны",
    choices: [
      "статистическая таблица",
      "статистический макет",
      "формуляр",
      "cтатистическая диаграмма"]
    ,
    answers: ["статистическая таблица"]
  },

  {
    id: "statistics410",
    type: "multiplechoices",
    header: "Тест",
    title: "Cтатистическое сказуемое",
    theme: "Введение в статистику",
    text: "Cтатистическим сказуемым называется",
    choices: ["статистические совокупности, которые характеризуются различными показателями", "показатели, характеризующие совокупности", "сведения, расположенные в боковых заголовках таблицы", "числовые характеристики, размещенные в графах таблицы"],
    answers: ["показатели, характеризующие совокупности"]
  },

  {
    id: "statistics415",
    type: "multiplechoices",
    header: "Тест",
    title: "Чертежи в статистическом наблюдении",
    theme: "Введение в статистику",
    text: "– это чертеж, на котором статистические совокупности, характеризуемые определенными показателями, описываются с помощью условных географических образов и знаков",
    choices: ["Статистическое наблюдение", "Регистры", "Статистический график", "Размах вариации", "Статистическая таблица"],
    answers: ["Статистический график"]
  },

  {
    id: "statistics420",
    type: "multiplechoices",
    header: "Тест",
    title: "Способы наглядного представления статистических данных",
    theme: "Введение в статистику",
    text: "– система построенных особым образом горизонтальных строк и вертикальных столбцов, имеющих общий заголовок, заглавия граф и строк, на пересечении которых записываются статистические данные",
    choices: ["Статистическое наблюдение", "Регистры", "Статистический график", "Размах вариации", "Статистическая таблица"],
    answers: ["Статистическая таблица"]
  },

  {
    id: "statistics425", type: "multiplechoices", header: "Тест", title: "Секторные диаграммы",
    theme: "Введение в статистику",
    text: "Секторные диаграммы представляют собой", choices: ["круг, разделенный на секторы", "графическое изображение статистических данных в виде столбиков - прямоугольников", "изображение самих предметов", "статистическую кривую"], answers: ["круг, разделенный на секторы"]
  },

  {
    id: "statistics430",
    type: "multiplechoices",
    header: "Тест",
    title: "Выборочная совокупность – это …",
    theme: "Корреляционно-регрессионный анализ",
    text: "Выборочная совокупность – это …",
    choices: [
      "множество наблюдений, составляющих часть генеральной совокупности",
      "любое множество наблюдений",
      "значения случайной величины, удовлетворяющие условиям наблюдения",
      "значения случайной величины, принятые в процессе наблюдения"],
    answers: ["множество наблюдений, составляющих часть генеральной совокупности"]
  },


  {
    id: "statistics435",
    type: "multiplechoices",
    header: "Тест",
    title: "Геометрически, математическое ожидание случайной величины – это … распределения",
    theme: "Корреляционно-регрессионный анализ",
    text: "Геометрически, математическое ожидание случайной величины – это … распределения",
    choices: [
      "центр",
      "мера рассеяния относительно центра",
      "мера отклонения симметричного от нормального",
      "мера отклонения от симметричного"],
    answers: ["центр"],
    hint: `
        <img src="https://ebooks.kbsu.ru/g2p3.files/image079.jpg" class="img-fluid" alt="img">   
        <br>
      <img src="https://ebooks.kbsu.ru/g2p3.files/image079.jpg" class="img-fluid" alt="img">        
      `
  },





  { id: "statistics505", type: "multiplechoices", header: "Тест", title: "Относительные статистические показатели", theme: "Введение в статистику", text: "Относительные статистические показатели выражаются", choices: ["в отвлеченных числах или в %", "в промилле", "в чел./днях", "в именованных числах"], answers: ["в отвлеченных числах или в %"] },


  {
    id: "statistics510",
    type: "multiplechoices",
    header: "Тест",
    title: "Разность между максимальным и минимальным значениями признака",
    theme: "Введение в статистику",
    text: "– разность между максимальным и минимальным значениями признака в изучаемой совокупности",
    choices: ["Статистическое наблюдение", "Регистры", "Статистический график", "Размах вариации", "Статистическая таблица"],
    answers: ["Размах вариации"]
  },

  {
    id: "statistics515", type: "multiplechoices", header: "Тест", title: "Мода", theme: "Введение в статистику",
    text: "Модой в статистике называют",
    choices: ["значение признака, которые чаще всего встречается в данной совокупности", "значение признака у единицы, которое находится в середине упорядоченного ряда распределения", "значение признака, которое встречается в данной совокупности единственный раз", "отношение данных текущего уровня к предшествующему"],
    answers: ["значение признака, которые чаще всего встречается в данной совокупности"]
  },

  {
    id: "statistics520",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Среднее значение количества звонков",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87-047bac88-d466-426c-a32b-8f33eb960cf6'
        class='link-primary'>СРЗНАЧ (функция СРЗНАЧ) =AVERAGE(A1:A20)</a>`,
    text: `Введите формулу для расчета среднего количества звонков за месяц`,
    answer: "AVERAGE(C2:C13)",

  },

  {
    id: "statistics525",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Среднее значение продаж за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87-047bac88-d466-426c-a32b-8f33eb960cf6'
        class='link-primary'>СРЗНАЧ (функция СРЗНАЧ) =AVERAGE(A1:A20)</a>`,
    text: `Введите формулу для расчета средних продаж за месяц`,
    answer: "AVERAGE(D2:D13)",

  },

  {
    id: "statistics530",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Среднее значение рекламного бюджета за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87-047bac88-d466-426c-a32b-8f33eb960cf6'
        class='link-primary'>СРЗНАЧ (функция СРЗНАЧ) =AVERAGE(A1:A20)</a>`,
    text: `Введите формулу для расчета среднего рекламного бюджета за месяц`,
    answer: "AVERAGE(B2:B13)",
    hint: `Среднее это...`
  },

  {
    id: "statistics530",
    header: "Типовая задача",
    type: "quizwithrandomnumber",
    title: "Чему равна мода этой совокупности?",
    theme: "Задачи и виды статистической сводки",
    text: `
      Найдите моду для статистической совокупности<br>
      <div>{=5000-4*{var1-10}*100}</div>              
      <div>{=5000-2*{var1-10}*100}</div>
      <div>{=5000-5*{var1-10}*100}</div>
      <div>{=5000-4*{var1-10}*100}</div>               
      <div>{=5000-3*{var1-10}*100}</div>
      <div>{=5000-1*{var1-10}*100}</div>
      <div>{=5000-4*{var1-10}*100}</div>
      <div>{=5000-1*{var1-10}*100}</div>
      `,
    answer: "5000-4*{var1-10}*100",
    hint: `
      <a
       href='https://support.microsoft.com/en-us/office/mode-function-e45192ce-9122-4980-82ed-4bdc34973120'
       class='link-primary'>MODE.SNGL</a><br>
      Мода - значение, которое встречается в выборке чаще всего`
  },

  {
    id: "statistics535",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Введите формулу для расчета медианы по рекламному бюджету за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B5%D0%B4%D0%B8%D0%B0%D0%BD%D0%B0-d0916313-4753-414c-8537-ce85bdd967d2'
        class='link-primary'>МЕДИАНА(MEDIAN) - Находит медиану заданных чисел</a>`,
    text: `Введите формулу для расчета медианы по рекламному бюджету за месяц`,
    answer: "MEDIAN(B2:B13)",
  },

  {
    id: "statistics540",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Введите формулу для расчета стандартное отклонение по рекламному бюджету за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/en-us/office/stdev-s-function-7d69cf97-0c1f-4acf-be27-f3e83904cc23'
       class='link-primary'>СТАНДОТКЛОН(STDEV.S) - Оценивает стандартное отклонение по выборке</a>`,
    text: `Введите формулу для расчета стандартное отклонение по по рекламному бюджету за месяц`,
    answer: "STDEV.S(B2:B13)",
  },

  {
    id: "statistics545",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Сумма квадратов отклонений по продажам за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%B2%D0%B0%D0%B4%D1%80%D0%BE%D1%82%D0%BA%D0%BB-8b739616-8376-4df5-8bd0-cfe0a6caf444'
        class='link-primary'>КВАДРОТКЛ(DEVSQ) - Вычисляет сумму квадратов отклонений</a>
        <br>
        <img src="https://support.content.office.net/ru-ru/media/a9363129-a835-4993-a78c-5501269f3447.gif" />
       ` ,
    text: `Введите формулу для расчета суммы квадратов отклонений по продажам за месяц`,
    answer: "DEVSQ(D2:D13)",
  },
  {
    id: "statistics550",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Среднее абсолютных значений отклонений точек данных от среднего по количеству звонков за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%BE%D1%82%D0%BA%D0%BB-58fe8d65-2a84-4dc7-8052-f3f87b5c6639'
        class='link-primary'>=СРОТКЛ =AVEDEV является мерой разброса множества данных</a>`,
    text: `Введите формулу для расчета среднего абсолютных значений отклонений точек данных от среднего по количеству звонков за месяц<br>`,
    answer: "AVEDEV(C2:C13)",
  },


  {
    id: "statistics555",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Среднее абсолютных значений отклонений точек данных от среднего по рекламному бюджету за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%BE%D1%82%D0%BA%D0%BB-58fe8d65-2a84-4dc7-8052-f3f87b5c6639'
        class='link-primary'>СРОТКЛ AVEDEV является мерой разброса множества данных</a>`,
    text: `Введите формулу для расчета среднего абсолютных значений отклонений точек данных от среднего по рекламному бюджету за месяц`,
    answer: "AVEDEV(B2:B13)",
  },

  {
    id: "statistics560",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Расчет среднего абсолютных значений отклонений точек данных от среднего по продажам за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%BE%D1%82%D0%BA%D0%BB-58fe8d65-2a84-4dc7-8052-f3f87b5c6639'
        class='link-primary'>СРОТКЛ AVEDEV является мерой разброса множества данных</a>`,
    text: `Введите формулу для расчета среднего абсолютных значений отклонений точек данных от среднего по продажам за месяц`,
    answer: "AVEDEV(D2:D13)",

  },




  {
    id: "statistics605", type: "multiplechoices", header: "Тест", title: "Темп роста",
    theme: "Введение в статистику",
    text: "Темп роста вычисляется, как", choices: ["отношение уровней ряда", "разность уровней ряда", "произведение уровней ряда", "разность темпа прироста к 100%"], answers: ["отношение уровней ряда"]
  },
  {
    id: "statistics610", type: "multiplechoices", header: "Тест", title: "Абсолютные статистические показатели", theme: "Введение в статистику",
    text: "Абсолютные статистические показатели выражаются",
    choices: ["процентах", "в именованных числах", "в коэффициентах", "в промилях"],
    answers: ["в именованных числах"]
  },



  {
    id: "statistics615",
    type: "multiplechoices",
    header: "Тест",
    title: "Временные ряды – это данные, характеризующие … момент (ы) времени",
    theme: "Корреляционно-регрессионный анализ",
    text: "Временные ряды – это данные, характеризующие … момент (ы) времени",
    choices: [
      "один и тот же объект в различные",
      "разные объекты в один и тот же",
      "один и тот же объект в один и тот же",
      "разные объекты в различные"],
    answers: ["один и тот же объект в различные"]
  },



  // {
  //     id: "statistics301",
  //     header: "Типовая задача",
  //     type: "quizwithrandomnumber",
  //     title: "Чему равно среднее арифметическое значение этой совокупности?",
  //     theme: "Задачи и виды статистической сводки",
  //     text: `
  //     <div>{=5000-4*{var1-10}*100}</div>              
  //     <div>{=5000-2*{var1-10}*100}</div>
  //     <div>{=5000-5*{var1-10}*100}</div>
  //     <div>{=5000-4*{var1-10}*100}</div>               
  //     <div>{=5000-3*{var1-10}*100}</div>
  //     <div>{=5000-1*{var1-10}*100}</div>
  //     <div>{=5000-4*{var1-10}*100}</div>
  //     <div>{=5000-1*{var1-10}*100}</div>
  //     `,
  //     answer: "5000-3*{var1-10}*100",
  //     hint: `
  //     <a
  //      href='https://support.microsoft.com/en-us/office/average-function-047bac88-d466-426c-a32b-8f33eb960cf6'
  //      class='link-primary'>AVERAGE</a><br>
  //     Необходимо все сложить и поделить на количество
  //     `
  // },

  // {
  //     id: "statistics301",
  //     header: "Типовая задача",
  //     type: "quizwithrandomnumber",
  //     title: "Чему равна медиана этой совокупности?",
  //     theme: "Задачи и виды статистической сводки",
  //     text: `
  //     <div>{=5000-4*{var1-10}*100}</div>              
  //     <div>{=5000-2*{var1-10}*100}</div>
  //     <div>{=5000-5*{var1-10}*100}</div>
  //     <div>{=5000-4*{var1-10}*100}</div>    
  //      <div>{=5000-4*{var1-10}*100}</div>            
  //     <div>{=5000-3*{var1-10}*100}</div>
  //     <div>{=5000-1*{var1-10}*100}</div>
  //     <div>{=5000-4*{var1-10}*100}</div>
  //     <div>{=5000-1*{var1-10}*100}</div>
  //     `,
  //     answer: "5000-4*{var1-10}*100",
  //     hint: `
  //      <a
  //      href='https://support.microsoft.com/en-us/office/median-function-d0916313-4753-414c-8537-ce85bdd967d2'
  //      class='link-primary'MEDIAN</a><br>
  //     Медиана — «серединное» значение.
  //     Если построить все данные в ряд по возрастанию, медианное значение окажется ровно посреди ряда: половина остальных значений меньше, половина больше`
  // },







  {
    id: "statistics748",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Наклон линии линейной регрессии для точек данных по уравнению регрессии рекламный бюджет и продажи за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%B0%D0%BA%D0%BB%D0%BE%D0%BD-11fb8f97-3117-4813-98aa-61d7e01276b9'
        class='link-primary'>=Наклон =SLOPE</a><br>
        Возвращает наклон линии линейной регрессии для точек данных в аргументах известные_значения_y и известные_значения_x.<br>
        Наклон определяется как частное от деления расстояния по вертикали на расстояние по горизонтали между двумя любыми точками прямой;<br>
        иными словами, наклон — это скорость изменения значений вдоль прямой<br>
        Например, можно вычислить насколько изменяются продажи в млн. руб. при изменении бюджета рекламы на 1 млн. руб.
        `,
    text: `Рассчитайте наклон линии линейной регрессии для точек данных по уравнению регрессии рекламный бюджет и продажи за месяц`,
    answer: "SLOPE(D2:D13,B2:B13)",
  },

  {
    id: "statistics743",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Отрезок, отсекаемый на оси линией линейной регрессии за месяц по уравнению регрессии рекламный бюджет и продажи за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D1%82%D1%80%D0%B5%D0%B7%D0%BE%D0%BA-2a9b74e2-9d47-4772-b663-3bca70bf63ef'
        class='link-primary'>INTERCEPT ОТРЕЗОК</a>
        Вычисляет точку пересечения линии с осью y, используя значения аргументов "известные_значения_x" и "известные_значения_y".<br>
        Точка пересечения находится на оптимальной линии регрессии, проведенной через точки, заданные аргументами "известные_значения_x" и "известные_значения_y". Функция ОТРЕЗОК используется, если нужно определить значение зависимой переменной при нулевом значении независимой переменной.<br>
         Например, в нвшем случае это продажи при нулевом рекламном бюджете`,
    text: `Рассчитайте отрезок, отсекаемый на оси линией линейной регрессии за месяц по уравнению регрессии рекламный бюджет и продажи за месяцу для расчета суммы квадратов отклонений по продажам за месяц`,
    answer: "INTERCEPT(D2:D13,B2:B13)",
  },

  {
    id: "statistics792",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Вычислите значение продаж при количестве звонков, равном 10",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D0%BF%D1%80%D0%BE%D0%B3%D0%BD%D0%BE%D0%B7-%D0%B8-%D0%BF%D1%80%D0%BE%D0%B3%D0%BD%D0%BE%D0%B7-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-linear-50ca49c9-7b40-4892-94e4-7ad38bbeda99'
        class='link-primary'>Функция =ПРОГНОЗ =FORECAST</a>
        Вычислите или спрогнозируйте будущее значение с помощью существующих значений. Будущее значение является значением y для заданного X-значения. Существующие значения являются известными значениями x и y, а будущее значение прогнозируется с помощью линейной регрессии. Эти функции можно использовать для прогнозирования будущих продаж, требований к запасам или потребительских тенденций.`,
    text: `Вычислите значение продаж при количестве звонков, равном 10`,
    answer: "FORECAST(10,D2:D13,C2:C13)",
  },


  {
    id: "statistics309",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Найдите ковариацию между количеством звонков и продажами",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D0%BA%D0%BE%D0%B2%D0%B0%D1%80%D0%B8%D0%B0%D1%86%D0%B8%D1%8F-%D0%B3-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D0%B2%D0%B0%D1%80%D0%B8%D0%B0%D1%86%D0%B8%D1%8F-%D0%B3-6f0e1e6d-956d-4e4b-9943-cfef0bf9edfc'
        class='link-primary'>COVARIANCE.P</a>
        <br>
        <img src="https://support.content.office.net/ru-ru/media/b5051bb7-e20d-4b81-867f-080decc48390.gif" />
        <br>
        Ковариация, то есть среднее произведений отклонений для каждой пары точек
        В теории вероятностей и статистике ковариация является мерой совместной изменчивости двух случайных величин.<br>
        Если большие значения одной переменной в основном соответствуют большим значениям другой переменной,<br>
        и то же самое верно для меньших значений (то есть переменные имеют тенденцию одинаковой направленности)<br>
         — ковариация положительна.
         <br> При отрицательной ковариации большие значения одной переменной в основном соответствуют меньшим значениям другой и наоборот<br>
         (то есть переменные имеют тенденцию противоположной направленности).<br>
          Величину ковариации труднее интерпретировать, поскольку она не нормирована и, следовательно,<br>
          зависит от размерности величин. <br>
          Нормализованная версия ковариации — коэффициент корреляции — своей величиной показывает силу линейной зависимости
        `,
    text: `Введите формулу для расчета ковариации между количеством звонков и продажами`,
    answer: "COVARIANCE.P(D2:D13,C2:C13)",
  },

  {
    id: "statistics905",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Найдите коэффициент корреляции между количеством звонков и продажами",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D1%80%D1%80%D0%B5%D0%BB-995dcef7-0c0a-4bed-a3fb-239d7b68ca92'
        class='link-primary'>
        Функция CORREL возвращает коэффициент корреляции двух диапазонов ячеек.<br>
        Коэффициент корреляции используется для определения взаимосвязи между двумя свойствами.<br>
        Например, можно установить зависимость между средней температурой в помещении и использованием кондиционера
        </a>
        <br>
        <img class='m-3' src="https://support.content.office.net/ru-ru/media/20801406-bfa6-4991-b08f-ebdc0c76af8c.gif" class="img-fluid" alt="...">
        <br>
        <a class="m-2" href="https://journal.tinkoff.ru/correlation/">Что такое корреляция акций и облигаций?</a>
        
        `,
    text: `Введите формулу для расчета коэффициента корреляции между количеством звонков и продажами`,
    answer: "CORREL(D2:D13,C2:C13)",
  },

  {
    id: "statistics908",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Найдите коэффициент корреляции между рекламным бюджетом и продажами",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D1%80%D1%80%D0%B5%D0%BB-995dcef7-0c0a-4bed-a3fb-239d7b68ca92'
        class='link-primary'>
        Функция CORREL возвращает коэффициент корреляции двух диапазонов ячеек.<br>
        Коэффициент корреляции используется для определения взаимосвязи между двумя свойствами.<br>
        Например, можно установить зависимость между средней температурой в помещении и использованием кондиционера
        </a>
        <br>
        <img class='m-3' src="https://support.content.office.net/ru-ru/media/20801406-bfa6-4991-b08f-ebdc0c76af8c.gif" class="img-fluid" alt="...">
        <br>
        <a class="m-2" href="https://journal.tinkoff.ru/correlation/">Что такое корреляция акций и облигаций?</a>
   
        `,
    text: `Введите формулу для расчета коэффициента корреляции между рекламным бюджетом и продажами`,
    answer: "CORREL(D2:D13,B2:B13)",
  },





  {
    id: "statistics499",
    type: "multiplechoices",
    header: "Тест",
    title: "Статистической зависимостью называется …",
    theme: "Корреляционно-регрессионный анализ",
    text: "Статистической зависимостью называется …",
    choices: [
      "точная формула, связывающая переменные",
      "связь переменных без учета воздействия случайных факторов",
      "связь переменных, на которую накладывается воздействие случайных факторов",
      "любая связь переменных"],
    answers: ["связь переменных, на которую накладывается воздействие случайных факторов"]
  },

  {
    id: "statistics400",
    type: "multiplechoices",
    header: "Тест",
    title: "Коэффициент регрессии k(a) показывает …",
    theme: "Корреляционно-регрессионный анализ",
    text: "Коэффициент регрессии k(a) показывает …",
    choices: [
      "как меняется переменная y при увеличении переменной x на 1%",
      "прогнозируемое значение зависимой переменной при x = 0",
      "прогнозируемое значение зависимой переменной при x > 0",
      "прогнозируемое значение зависимой переменной при x < 0"],
    answers: ["как меняется переменная y при увеличении переменной x на 1%"]
  },

  {
    id: "statistics401",
    type: "multiplechoices",
    header: "Тест",
    title: "Выборочная ковариация является мерой … двух переменных",
    theme: "Корреляционно-регрессионный анализ",
    text: "Выборочная ковариация является мерой … двух переменных",
    choices: [
      "взаимосвязи",
      "нелинейной связи",
      "рассеяния",
      "линейной связи"],
    answers: ["взаимосвязи"]
  },







  {
    id: "statistics905",
    type: "multiplechoices",
    header: "Тест",
    title: "Коэффициент регрессии b показывает …",
    theme: "Корреляционно-регрессионный анализ",
    text: "Коэффициент регрессии b показывает …",
    choices: [
      "на сколько единиц в среднем изменяется переменная y при увеличении независимой переменной x на единицу",
      "прогнозируемое значение зависимой переменной при x = 0",
      "прогнозируемое значение зависимой переменной при x > 0",
      "прогнозируемое значение зависимой переменной при x < 0"],
    answers: ["прогнозируемое значение зависимой переменной при x = 0"]
  },


  {
    id: "statistics910",
    type: "multiplechoices",
    header: "Тест",
    title: "Коэффициенты регрессии (а, b) в выборочном уравнении регрессии определяются методом (ами) …",
    theme: "Корреляционно-регрессионный анализ",
    text: "Коэффициенты регрессии (а, b) в выборочном уравнении регрессии определяются методом (ами) …",
    choices: [
      "наименьших квадратов",
      "взвешенных наименьших квадратов",
      "моментов",
      "градиентными"],
    answers: ["наименьших квадратов"]
  },




  {
    id: "statistics407",
    type: "multiplechoices",
    header: "Тест",
    title: "Коэффициентом детерминации R^2 характеризуют долю вариации переменной … с помощью уравнения регрессии",
    theme: "Корреляционно-регрессионный анализ",
    text: "Коэффициентом детерминации R^2 характеризуют долю вариации переменной … с помощью уравнения регрессии",
    choices: [
      "зависимой, объясненную",
      "зависимой, необъясненную",
      "независимой, объясненную",
      "независимой, необъясненную"],
    answers: ["зависимой, объясненную"],
    hint: `
      После проверки точности и статистической значимости каждого коэффициента регрессионной модели обычно проводится анализ общего качества уравнения модели, которое оценивается по тому,
      как хорошо эмпирическое уравнение регрессии согласуется со статистическими данными.<br>
      Другими словами, необходимо оценить, насколько широко рассеяны точки наблюдений по их совокупности относительно линии регрессии (линии модели). Поэтому представляется естественным вывод о том, что проверку общего качества регрессионной модели следует проводить на основе дисперсионного анализа, сравнивая дисперсии модельных и реальных значений исследуемой переменной У        
      `
  },

  {
    id: "statistics408",
    type: "multiplechoices",
    header: "Тест",
    title: "Величина var(y) – это дисперсия значений … переменной",
    theme: "Корреляционно-регрессионный анализ",
    text: "Величина var(y) – это дисперсия значений … переменной",
    choices: [
      "наблюдаемых зависимой",
      "наблюдаемых независимой",
      "расчетных зависимой",
      "расчетных независимой"],
    answers: ["расчетных зависимой"],
    hint: `        
      <img src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRKODO3GojGV7hIRKM0N00CDab29uhC57EELg&s" 
      class="img-fluid" alt="img">        
      `
  },

  {
    id: "statistics729",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Квадрат коэффициента корреляции Пирсона по уравнению регрессии рекламный бюджет и продажи за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%B2%D0%BF%D0%B8%D1%80%D1%81%D0%BE%D0%BD-d7161715-250d-4a01-b80d-a8364f2be08f'
        class='link-primary'>
КВПИРСОН RSQ 
        <a>
        Возвращает квадрат коэффициента корреляции Пирсона для точек данных в аргументах "известные_значения_y" и "известные_значения_x". <br>
        Значение квадрата R показывает, насколько дисперсии y связана с дисперсией x.
        `,
    text: `Рассчитайте квадрат коэффициента корреляции Пирсона по уравнению регрессии рекламный бюджет и продажи за месяц`,
    answer: "RSQ(D2:D13,B2:B13)",
  },

  {
    id: "statistics727",
    header: "Кейс",
    type: "casewithrandomnumber",
    title: "Стандартная ошибка предсказанных значений y для каждого значения x в регрессии по уравнению регрессии рекламный бюджет и продажи за месяц",
    theme: "Средние величины в статистике",
    dataArray: [
      ["Месяц", "Рекл. бюдж. (X1)", "Звонки кл. (X2)", "Продажи (Y)"],
      ["январь", 8, 20, 52],
      ["февраль", 9, 22, 55],
      ["март", 10, 18, 53],
      ["апрель", 11, 25, 60],
      ["май", 12, 27, 62],
      ["июнь", 10, 21, 58],
      ["июль", 13, 29, 65],
      ["август", 14, 30, 68],
      ["сентябрь", 13, 26, 66],
      ["октябрь", 15, 32, 72],
      ["ноябрь", 16, 34, 75],
      ["декабрь", 17, 36, 80],
    ],
    hint: `<a
       href='https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%BE%D1%88yx-6ce74b2c-449d-4a6e-b9ac-f9cef5ba48ab'
        class='link-primary'>Функция СТОШYX STEYX 
         </a>
       Возвращает стандартную ошибку предсказанных значений y для каждого значения x в регрессии. Стандартная ошибка — это мера ошибки предсказанного значения y для отдельного значения x.
       `,
    text: `Рассчитайте стандартную ошибку предсказанных значений y для каждого значения x в регрессии по уравнению регрессии рекламный бюджет и продажи за месяц`,
    answer: "STEYX(D2:D13,B2:B13)",
  },

];


const beta_abstract_cases = [
  {
    header: "Типовая задача", title: "Оцените Beta 1", theme: "Финансовые рынки. Трейдинг",
    text: "Интерактивный график",
    choices: [
      "Защитный актив с положительной, чуть больше 0, Beta - облигация",
      "Акция с Beta, близкой к нулю",
      "Акция с Beta, больше 1",
      "Акция с Beta, немного меньшей 1",
      "Защитный актив с отрицательной Beta - золото"
    ],
    answers: ["Акция с Beta, больше 1"],
    laboratoryChart: "betamorethanone"
  },

  {
    header: "Типовая задача", title: "Оцените Beta 2", theme: "Финансовые рынки. Трейдинг",
    text: "Интерактивный график",
    choices: [
      "Защитный актив с положительной, чуть больше 0, Beta - облигация",
      "Акция с Beta, близкой к нулю",
      "Акция с Beta, больше 1",
      "Акция с Beta, немного меньшей 1",
      "Защитный актив с отрицательной Beta - золото"
    ],
    answers: ["Защитный актив с отрицательной Beta - золото"],
    laboratoryChart: "betabelowzero"
  },

  {
    header: "Типовая задача", title: "Оцените Beta 3", theme: "Финансовые рынки. Трейдинг",
    text: "Интерактивный график",
    choices: [
      "Защитный актив с положительной, чуть больше 0, Beta - облигация",
      "Акция с Beta, близкой к нулю",
      "Акция с Beta, больше 1",
      "Акция с Beta, немного меньшей 1",
      "Защитный актив с отрицательной Beta - золото"
    ],
    answers: ["Акция с Beta, близкой к нулю"],
    laboratoryChart: "betarandom"
  },

  {
    header: "Типовая задача", title: "Оцените Beta 4", theme: "Финансовые рынки. Трейдинг",
    text: "Интерактивный график",
    choices: [
      "Защитный актив с положительной, чуть больше 0, Beta - облигация",
      "Акция с Beta, близкой к нулю",
      "Акция с Beta, больше 1",
      "Акция с Beta, немного меньшей 1",
      "Защитный актив с отрицательной Beta - золото"
    ],
    answers: ["Акция с Beta, немного меньшей 1"],
    laboratoryChart: "betalessthanone"
  },

  {
    header: "Типовая задача", title: "Оцените Beta 5", theme: "Финансовые рынки. Трейдинг",
    text: "Интерактивный график",
    choices: [
      "Защитный актив с положительной, чуть больше 0, Beta - облигация",
      "Акция с Beta, близкой к нулю",
      "Акция с Beta, больше 1",
      "Акция с Beta, немного меньшей 1",
      "Защитный актив с отрицательной Beta - золото"
    ],
    answers: ["Защитный актив с положительной, чуть больше 0, Beta - облигация"],
    laboratoryChart: "betabond"
  },
]

const balance_financial_solvency_analysis_cases = [
  {
    header: "Кейс",
    title: "Кейс Анализ платежеспособности",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте коэффициент абсолютной ликвидности за все отчетные периоды, десятичная дробь",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-Ma3vVgKeXsSP07-pwDW"
  },


  {
    header: "Кейс",
    title: "Кейс Анализ платежеспособности",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте коэффициент быстрой (промежуточной) ликвидности за все отчетные периоды, десятичная дробь",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-Ma3vVgKeXsSP07-pwDW"
  },


  {
    header: "Кейс",
    title: "Кейс Анализ платежеспособности",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте коэффициент текущей ликвидности за все отчетные периоды, десятичная дробь",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-Ma3vVgKeXsSP07-pwDW"
  }
]

const balance_advanced_financial_ratios_cases = [
  {
    header: "Кейс",
    title: "Кейс Анализ платежеспособности",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте на какую сумму внеоборотные активы профинансированы за счет собственного капитала за все отчетные периоды, млрд. руб",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-Ma3vVgKeXsSP07-pwDW"
  },


  {
    header: "Кейс",
    title: "Кейс Анализ платежеспособности",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте на какую сумму внеоборотные активы профинансированы за счет долгосрочных обязательств за все отчетные периоды, млрд. руб",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-Ma3vVgKeXsSP07-pwDW"
  },


  {
    header: "Кейс",
    title: "Кейс Анализ платежеспособности",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте на какую сумму запасы профинансированы за счет собственного капитала за все отчетные периоды, млрд. руб",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-Ma3vVgKeXsSP07-pwDW"
  },


  {
    header: "Кейс",
    title: "Кейс Анализ платежеспособности",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте на какую сумму запасы профинансированы за счет долгосрочных обязательств за все отчетные периоды, млрд. руб",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-Ma3vVgKeXsSP07-pwDW"
  },


  {
    header: "Кейс",
    title: "Кейс Анализ платежеспособности",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте на какую сумму запасы профинансированы за счет краткосрочных кредитов и займов за все отчетные периоды, млрд. руб",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-Ma3vVgKeXsSP07-pwDW"
  },


  {
    header: "Кейс",
    title: "Кейс Анализ платежеспособности",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте на какую сумму запасы профинансированы за счет кредиторской задолженности за все отчетные периоды, млрд. руб",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-Ma3vVgKeXsSP07-pwDW"
  },

]



const balance_financial_ratios_cases = [
  {
    header: "Кейс",
    title: "Кейс Собственные оборотные средства",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте собственные оборотные средства за все отчетные периоды в млрд. руб.",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-MZxOS3w4oQff2lTXWRU"
  },

  {
    header: "Кейс",
    title: "Диаграмма Соотношение основных разделов баланса",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Общая оценка финансовой устойчивости",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "charts/-Ma2vHSilqENAtWbZI7v"
  },

  {
    header: "Кейс",
    title: "Кейс Коэффициент обеспеченности собственными оборотными средствами",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте коэффициент обеспеченности собственными оборотными средствами за все отчетные периоды, дес. дробь",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-MZxOS3w4oQff2lTXWRU"
  },

  {
    header: "Кейс",
    title: "Кейс Коэффициент маневренности собственного капитала",
    theme: "Анализ финансового состояния и хозяйственной деятельности компании",
    text: "Рассчитайте коэффициент маневренности собственного капитала за все отчетные периоды, дес. дробь",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-MZxOS3w4oQff2lTXWRU"
  }

];

const margin_leverages_cases = [
  {
    header: "Типовая задача",
    title: "Кейс Распределение затрат на постоянные и переменные. Постоянные затраты",
    theme: "Маржинальный анализ. Рычаги",
    text: "На основе коэффициента реагирования затрат - y=kx+b - рассчитайте постоянные затраты организации в млрд. руб.",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-M__wWrqImWnKWKFA3Uy"
  },

  {
    header: "Типовая задача",
    title: "Кейс Распределение затрат на постоянные и переменные. Диаграмма",
    theme: "Маржинальный анализ. Рычаги",
    text: "Динамика постоянных, переменных, полных затрат и выручки",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "mediaeditor/arraycategorieslineapexchart"
  },


  {
    header: "Типовая задача",
    title: "Кейс Распределение затрат на постоянные и переменные. Точка безубыточности",
    theme: "Маржинальный анализ. Рычаги",
    text: "На основе коэффициента реагирования затрат - y=kx+b - рассчитайте найдите точку безубыточности в млрд. руб.",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-M__wWrqImWnKWKFA3Uy"
  },
  {
    header: "Типовая задача",
    title: "Кейс Распределение затрат на постоянные и переменные. Запас финансовой прочности в млрд. руб.",
    theme: "Маржинальный анализ. Рычаги",
    text: "На основе коэффициента реагирования затрат - y=kx+b - рассчитайте запас финансовой прочности за последний период в млрд. руб.",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-M__wWrqImWnKWKFA3Uy"
  },

  {
    header: "Типовая задача",
    title: "Кейс Распределение затрат на постоянные и переменные. Запас финансовой прочности в процентах",
    theme: "Маржинальный анализ. Рычаги",
    text: "На основе коэффициента реагирования затрат - y=kx+b - рассчитайте запас финансовой прочности за последний период в процентах.",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "calculations/-M__wWrqImWnKWKFA3Uy"
  },

  {
    header: "Типовая задача",
    title: "Кейс Распределение затрат на постоянные и переменные. Комментарий",
    theme: "Маржинальный анализ. Рычаги",
    text: "Оцените компанию с точки зрения маржинального анализа",
    projectMoneyScale: "млрд. руб",
    usersTemplates: "mediaeditor/ckeditorclassic"
  },



  // {
  //   header: "Типовая задача",
  //   title: "Кейс Распределение затрат на постоянные и переменные. Диаграмма",
  //   theme: "Маржинальный анализ. Рычаги",
  //   text: "Динамика выручки и полных затрат",
  //   projectMoneyScale: "млрд. руб",
  //   usersTemplates: "mediaeditor/arraycategoriesbarapexchart"
  // },

  // {
  //   header: "Типовая задача",
  //   title: "Кейс Распределение затрат на постоянные и переменные. Диаграмма",
  //   theme: "Маржинальный анализ. Рычаги",
  //   text: "Динамика выручки и полных затрат",
  //   projectMoneyScale: "млрд. руб",
  //   usersTemplates: "mediaeditor/datetimelineapexchart"
  // },



  // {
  //   header: "Типовая задача",
  //   title: "Кейс Распределение затрат на постоянные и переменные. Диаграмма",
  //   theme: "Маржинальный анализ. Рычаги",
  //   text: "Динамика постоянных, переменных, полных затрат и выручки",
  //   projectMoneyScale: "млрд. руб",
  //   usersTemplates: "mediaeditor/scatterapexchart"
  // },

  // {
  //   header: "Типовая задача",
  //   title: "Кейс Распределение затрат на постоянные и переменные. Диаграмма",
  //   theme: "Маржинальный анализ. Рычаги",
  //   text: "Динамика постоянных, переменных, полных затрат и выручки",
  //   projectMoneyScale: "млрд. руб",
  //   usersTemplates: "mediaeditor/datetimeareanocategoriesapexchart"
  // },

  // {
  //   header: "Типовая задача",
  //   title: "Кейс Распределение затрат на постоянные и переменные. Диаграмма",
  //   theme: "Маржинальный анализ. Рычаги",
  //   text: "Динамика постоянных, переменных, полных затрат и выручки",
  //   projectMoneyScale: "млрд. руб",
  //   usersTemplates: "mediaeditor/datetimeareanocategoriesapexchart"
  // },

  // {
  //   header: "Типовая задача",
  //   title: "Кейс Распределение затрат на постоянные и переменные. Диаграмма",
  //   theme: "Маржинальный анализ. Рычаги",
  //   text: "Динамика постоянных, переменных, полных затрат и выручки",
  //   projectMoneyScale: "млрд. руб",
  //   usersTemplates: "mediaeditor/html"
  // },

  // {
  //   header: "Типовая задача",
  //   title: "Кейс Распределение затрат на постоянные и переменные. Диаграмма",
  //   theme: "Маржинальный анализ. Рычаги",
  //   text: "Динамика постоянных, переменных, полных затрат и выручки",
  //   projectMoneyScale: "млрд. руб",
  //   usersTemplates: "mediaeditor/markdown"
  // },

]

const balance_sheet_financials = [
  {
    header: "Типовая задача", title: "Коэффициент абсолютной ликвидности", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Уставный капитал {=2000-{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Материалы {=2000-2*{var1-10}*100}</td>
      <td>Нераспределенная прибыль {=2000+{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Незавершенное производство 1000</td>
      <td></td>
      </tr>
      <tr>
      <td>Готовая продукция 500 </td>
      <td>Долгосрочные обязательства {=2000-2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 1000</td>
      <td>Краткосрочный кредит 1000</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность {=1000+2*{var1-10}*100}</td>
      </tr>
      </tbody>
      </table>`,
    answer: "500/(2000+2*{var1-10}*100)"
  },

  {
    header: "Типовая задача", title: "Коэффициент промежуточной (быстрой) ликвидности", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Уставный капитал {=2000-{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Материалы {=2000-2*{var1-10}*100}</td>
      <td>Нераспределенная прибыль {=2000+{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Незавершенное производство 1000</td>
      <td></td>
      </tr>
      <tr>
      <td>Готовая продукция 500 </td>
      <td>Долгосрочные обязательства {=2000-2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 1000</td>
      <td>Краткосрочный кредит 1000</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность {=1000+2*{var1-10}*100}</td>
      </tr>
      </tbody>
      </table>`,
    answer: "1500/(2000+2*{var1-10}*100)"
  },

  {
    header: "Типовая задача", title: "Коэффициент текущей ликвидности", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+{var1-10}*100}</td>
      <td>Уставный капитал {=2000-{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Материалы {=2000-2*{var1-10}*100}</td>
      <td>Нераспределенная прибыль {=2000+{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Незавершенное производство 1000</td>
      <td></td>
      </tr>
      <tr>
      <td>Готовая продукция 500 </td>
      <td>Долгосрочные обязательства {=2000-2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 1000</td>
      <td>Краткосрочный кредит 1000</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность {=1000+{var1-10}*100}</td>
      </tr>
      </tbody>
      </table>`,
    answer: "(5000-2*{var1-10}*100)/(2000+{var1-10}*100)"
  },

  {
    header: "Типовая задача", title: "На какую сумму запасы профинансированы за счет собственного капитала? Чему равен собственный оборотный капитал?", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Собственный капитал {=4000+3*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Запасы {=5000-2*{var1-10}*100}</td>
      <td>Долгосрочные обязательства 1000</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 1500</td>
      <td>Краткосрочный кредит {=4000-3*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность 1000</td>
      </tr></tbody>
      </table>`,
    answer: "4000+3*{var1-10}*100-(3000+2*{var1-10}*100)"
  },


  {
    header: "Типовая задача", title: "Коэффициент обеспеченности собственными оборотными средствами", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000-{var1-10}*100}</td>
      <td>Уставный капитал 2000</td>
      </tr>
      <tr>
      <td>Материалы {=2000+{var1-10}*100}</td>
      <td>Нераспределенная прибыль {=2000+{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Незавершенное производство 1000</td>
      <td></td>
      </tr>
      <tr>
      <td>Готовая продукция 500 </td>
      <td>Долгосрочные обязательства {=2000-{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 1000</td>
      <td>Краткосрочный кредит 1000</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность 1000</td>
      </tr>
      </tbody>
      </table>`,
    answer: "(1000+2*{var1-10}*100)/(5000+{var1-10}*100)"
  },

  {
    header: "Типовая задача", title: "Коэффициент маневренности", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000-2*{var1-10}*100}</td>
      <td>Уставный капитал 2000</td>
      </tr>
      <tr>
      <td>Материалы {=2000+{var1-10}*100}</td>
      <td>Нераспределенная прибыль {=2000+{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Незавершенное производство 1000</td>
      <td></td>
      </tr>
      <tr>
      <td>Готовая продукция 500 </td>
      <td>Долгосрочные обязательства {=2000-2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 1000</td>
      <td>Краткосрочный кредит 1000</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность 1000</td>
      </tr></tbody>
      </table>`,
    answer: "(1000+3*{var1-10}*100)/(4000+{var1-10}*100)"
  },

  {
    header: "Типовая задача", title: "Коэффициент автономии", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Собственный капитал {=4000-2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Запасы {=3000-2*{var1-10}*100}</td>
      <td>Долгосрочные обязательства 2000</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 3500</td>
      <td>Краткосрочный кредит {=2000+2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность 2000</td>
      </tr></tbody>
      </table>`,
    answer: "(4000-2*{var1-10}*100)/10000"
  },

  {
    header: "Типовая задача", title: "Коэффициент финансового рычага", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Собственный капитал {=4000-2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Запасы {=3000-2*{var1-10}*100}</td>
      <td>Долгосрочные обязательства 2000</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 3500</td>
      <td>Краткосрочный кредит {=2000+2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность 2000</td>
      </tr></tbody>
      </table>`,
    answer: "(10000-4000+2*{var1-10}*100)/(4000-2*{var1-10}*100)"
  },

  {
    header: "Типовая задача", title: "На какую сумму основные средства профинансированы за счет собственного капитала?", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Собственный капитал {=2000-2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Запасы {=3000-2*{var1-10}*100}</td>
      <td>Долгосрочные обязательства 2000</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 3500</td>
      <td>Краткосрочный кредит {=2000+2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность 4000</td>
      </tr></tbody>
      </table>`,
    answer: "2000-2*{var1-10}*100",
    media: [
      {
        type: "arraycategoriesbarapexchart",
        options: {
          chart: { type: 'bar', stacked: true, zoom: { enabled: true }, height: 600 },
          plotOptions: { bar: { borderRadius: 8, horizontal: false } },
          legend: { position: 'bottom' },
          fill: { opacity: 1 },
          colors: ['#dc3545', '#d63384', '#6f42c1', '#6610f2', '#0d6efd', '#adb5bd', '#dc3545', '#d63384', '#ffc107', '#198754', '#20c997', '#adb5bd']
        },
        series: [
          { name: "Деньги", data: [500, 0] },
          { name: "Дебиторская задолженность", data: [3500, 0] },
          { name: "Запасы", data: ["{=3000-2*{var1-10}*100}", 0] },
          { name: "Основные средства", data: ["{=3000+2*{var1-10}*100}", 0] },

          { name: "Кредиторская задолженность", data: [0, 4000] },
          { name: "Краткосрочный кредит", data: [0, "{=2000+2*{var1-10}*100}"] },
          { name: "Долгосрочные обязательства", data: [0, 2000] },
          { name: "Нераспределенная прибыль", data: [] },
          { name: "Собственный капитал", data: [0, "{=2000-2*{var1-10}*100}"] }
        ],
        categories: ['Активы', 'Пассивы'],
        chartTitle: "Структура баланса",
        xaxisTitle: "Баланс",
        yaxisTitle: "Значение"
      }
    ]
  },

  {
    header: "Типовая задача", title: "На какую сумму основные средства профинансированы за счет долгосрочных обязательств?", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Собственный капитал {=2000+0.2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Запасы {=3000-2*{var1-10}*100}</td>
      <td>Долгосрочные обязательства 3000</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 3500</td>
      <td>Краткосрочный кредит {=2000-0.2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность 1000</td>
      </tr></tbody>
      </table>`,
    answer: "3000+2*{var1-10}*100-2000-0.2*{var1-10}*100"
  },

  {
    header: "Типовая задача", title: "На какую сумму основные средства профинансированы за счет краткосрочного  кредита?", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Собственный капитал {=2000-2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Запасы {=3000-2*{var1-10}*100}</td>
      <td>Долгосрочные обязательства 1000</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 3500</td>
      <td>Краткосрочный кредит {=4000+2*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность 3000</td>
      </tr></tbody>
      </table>`,
    answer: "3000+2*{var1-10}*100-(2000-2*{var1-10}*100)-1000"
  },




  {
    header: "Типовая задача", title: "На какую сумму запасы профинансированы за счет долгосрочных обязательств?", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Собственный капитал {=3000+3*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Запасы {=4000-2*{var1-10}*100}</td>
      <td>Долгосрочные обязательства 3900</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 2500</td>
      <td>Краткосрочный кредит {=3000-3*{var1-10}*100}</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность 100</td>
      </tr></tbody>
      </table>`,
    answer: "4000-2*{var1-10}*100-(3000+3*{var1-10}*100)+3000+2*{var1-10}*100"
  },

  {
    header: "Типовая задача", title: "На какую сумму запасы профинансированы за счет краткосрочных обязательств?", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Собственный капитал {=3000+2*{var1-10}*100+500}</td>
      </tr>
      <tr>
      <td>Запасы {=4000-2*{var1-10}*100}</td>
      <td>Долгосрочные обязательства 1000</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 2500</td>
      <td>Краткосрочный кредит {=5000-2*{var1-10}*100-500}</td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность 1000</td>
      </tr></tbody>
      </table>`,
    answer: "4000-2*{var1-10}*100-500-1000"
  },

  {
    header: "Типовая задача", title: "На какую сумму запасы профинансированы за счет кредиторской задолженности?", theme: "Анализ финсостояния и хоздеятельности",
    text: `<table>
      <tbody>
      <tr>
      <th>АКТИВЫ</th>
      <th>ПАССИВЫ</th>
      </tr>
      </tbody>
      <tbody>
      <tr>
      <td>Основные средства {=3000+2*{var1-10}*100}</td>
      <td>Собственный капитал {=3000+2*{var1-10}*100+500}</td>
      </tr>
      <tr>
      <td>Запасы {=4000-2*{var1-10}*100}</td>
      <td>Долгосрочные обязательства 1000</td>
      </tr>
      <tr>
      <td>Дебиторская задолженность 2500</td>
      <td>Краткосрочный кредит 500 </td>
      </tr>
      <tr>
      <td>Деньги 500</td>
      <td>Кредиторская задолженность {=5500-2*{var1-10}*100-500}</td>
      </tr></tbody>
      </table>`,
    answer: "4000-2*{var1-10}*100-500-1000-500"
  }



]


const simple_accounting = [{
  type: "OneRandomManyAnswers",
  text: "Сформирован уставный капитал 5000</br>Внесены денежные средства в качестве вклада в уставный капитал 4800</br>Получены материалы от поставщика 6000</br>Материалы переданы в производство 5500</br>Начислена заработная плата 4000</br>Отражена задолженность по социальному страхованию 1250</br>Удержан налог на доходы физических лиц 500</br>Готовая продукция передана на склад 9000</br>80% готовой продукции продано за 12000</br>Получены денежные средства от покупателя 6000</br>Получен кредит в банке 5000</br>Начислены проценты по кредиту 50</br>Перечислено поставщику материалов 5000</br>Погашена задолженность по НДФЛ, соцстрахованию перед персоналом</br>",
  quizes: [
    { text: "Найти дивиденды", answer: "0.8*((1+{var1-10}/10)*(1200-720-200)-50-60)*1/2" }
  ]
}]

const stop_orders = [
  {
    header: "Типовая задача", title: "Время исполнения стоп заявки (условной заявки)", theme: "Финансовые рынки. Трейдинг",
    text: "Стоп заявки (условные заявки)",
    choices: ["исполняются немедленно", "активны до конца торговой сессии", "могут быть активны несколько торговых сессий до отмены"],
    answers: ["могут быть активны несколько торговых сессий до отмены"]
  },

  {
    header: "Типовая задача", title: "Стоп-заявка на покупку применяется для закрытия", theme: "Финансовые рынки. Трейдинг",
    text: "Стоп заявки (условные заявки)",
    choices: ["длинной позиции", "короткой позиции"],
    answers: ["короткой позиции"]
  },

  {
    header: "Типовая задача", title: "Стоп-заявка на покупку применяется для открытия", theme: "Финансовые рынки. Трейдинг",
    text: "Стоп заявки (условные заявки)",
    choices: ["длинной позиции", "короткой позиции"],
    answers: ["длинной позиции"]
  },

  {
    header: "Типовая задача", title: "Стоп-заявка на продажу применяется для закрытия", theme: "Финансовые рынки. Трейдинг",
    text: "Стоп заявки (условные заявки)",
    choices: ["длинной позиции", "короткой позиции"],
    answers: ["длинной позиции"]
  },

  {
    header: "Типовая задача", title: "Стоп-заявка на продажу применяется для открытия", theme: "Финансовые рынки. Трейдинг",
    text: "Стоп заявки (условные заявки)",
    choices: ["длинной позиции", "короткой позиции"],
    answers: ["короткой позиции"]
  },

  {
    header: "Типовая задача", title: "Стоп-заявка на покупку. Взаимосвязь цен", theme: "Финансовые рынки. Трейдинг",
    text: "Стоп заявки (условные заявки)",
    choices: [
      "Цена Стоп-лимит > Текущая Цена > Цена Тейк-профит",
      "Цена Стоп-лимит < Текущая Цена < Цена Тейк-профит",
      "Текущая Цена > Цена Стоп-лимит >  Цена Тейк-профит",
      "Текущая Цена < Цена Стоп-лимит <  Цена Тейк-профит",
      "Текущая Цена > Цена Тейк-профит > Цена Стоп-лимит",
      "Текущая Цена < Цена Тейк-профит < Цена Стоп-лимит",
    ],
    answers: ["Цена Стоп-лимит > Текущая Цена > Цена Тейк-профит"]
  },

  {
    header: "Типовая задача", title: "Стоп-заявка на продажу. Взаимосвязь цен", theme: "Финансовые рынки. Трейдинг",
    text: "Стоп заявки (условные заявки)",
    choices: [
      "Цена Стоп-лимит > Текущая Цена > Цена Тейк-профит",
      "Цена Стоп-лимит < Текущая Цена < Цена Тейк-профит",
      "Текущая Цена > Цена Стоп-лимит >  Цена Тейк-профит",
      "Текущая Цена < Цена Стоп-лимит <  Цена Тейк-профит",
      "Текущая Цена > Цена Тейк-профит > Цена Стоп-лимит",
      "Текущая Цена < Цена Тейк-профит < Цена Стоп-лимит",
    ],
    answers: ["Цена Стоп-лимит < Текущая Цена < Цена Тейк-профит"]
  },

  {
    header: "Типовая задача", title: "Защитный спрэд в X руб. в Стоп-заявке на покупку выставляется по принципу", theme: "Финансовые рынки. Трейдинг",
    text: "Стоп заявки (условные заявки)",
    choices: [
      "Текущая Цена + Х",
      "Текущая Цена - Х"
    ],
    answers: ["Текущая Цена + Х"]
  },

  {
    header: "Типовая задача", title: "Защитный спрэд в X руб. в Стоп-заявке на продажу выставляется по принципу", theme: "Финансовые рынки. Трейдинг",
    text: "Стоп заявки (условные заявки)",
    choices: [
      "Текущая Цена + Х",
      "Текущая Цена - Х"
    ],
    answers: ["Текущая Цена - Х"]
  }
]

const put_option_seller = [
  {
    header: "Типовая задача", title: "Продавец опциона на продажу. Тренд", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Продавец опциона на продажу рассчитывает на...",
    choices: ["медвежий тренд", "бычий тренд"],
    answers: ["бычий тренд"],
    imageurl: "/bullbear.jpg"
  },

  {
    header: "Типовая задача", title: "Продавец опциона на продажу. Размер прибыли", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Прибыль продавца опционов на продажу",
    choices: ["не ограничена", "ограничена"],
    answers: ["ограничена"]
  },

  {
    header: "Типовая задача", title: "Продавец опциона на продажу. Размер убытков", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Прибыль продавца опционов на продажу",
    choices: ["не ограничен", "ограничен"],
    answers: ["не ограничен"]
  },

  {
    header: "Типовая задача", title: "Продавец опциона на продажу. Хеджирование кредитной сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Продавец опциона на продажу валюты хеджирует",
    choices: ["получение кредитов в валюте", "выдачу кредитов в валюте"],
    answers: ["получение кредитов в валюте"]
  },

  {
    header: "Типовая задача", title: "Продавец опциона на продажу. Хеджирование внешнеторговой сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Продавец опциона на продажу валюты хеджирует",
    choices: ["импорт с отсрочкой платежа", "экспорт с отсрочкой платежа"],
    answers: ["импорт с отсрочкой платежа"]
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат продавца опциона на продажу 1", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Продали опцион на продажу по 4 RUB за каждый USD контракта. Цена по опциону 77 руб. Найти финансовый результат продавца опциона в млн. руб при курсе USD {=77-{var1-10}} руб в июне",
    answer: "4-{var1-10}"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат продавца опциона на продажу 2", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Продали опцион на продажу по {={var1-10}/2} RUB за каждый USD контракта. Цена по опциону 77 руб. Найти финансовый результат продавца опциона в млн. руб при курсе USD {=77+{var1-10}} руб в июне",
    answer: "{var1-10}/2"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат продавца опциона на продажу 3", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Продали опцион на продажу по 5 RUB за каждый USD контракта. Цена по опциону 80 руб. Найти финансовый результат продавца опциона в млн. руб при курсе USD {=80-{var1-10}/2} руб в июне",
    answer: "5-{var1-10}/2"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат продавца опциона на продажу. Безубыточность", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Продали опцион на продажу по {={var1-10}/2} RUB за каждый USD контракта. Цена по опциону 77 руб. Найти курс USD при нулевом финансовом результате",
    answer: "77-{var1-10}/2"
  }
]

const put_option_holder = [
  {
    header: "Типовая задача", title: "Покупатель опциона на продажу. Тренд", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Покупатель опциона на продажу рассчитывает на...",
    choices: ["медвежий тренд", "бычий тренд"],
    answers: ["медвежий тренд"],
    imageurl: "/bullbear.jpg"
  },

  {
    header: "Типовая задача", title: "Покупатель опциона на продажу. Размер прибыли", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Прибыль покупателя опционов на продажу",
    choices: ["ограничена", "не ограничена"],
    answers: ["не ограничена"]
  },

  {
    header: "Типовая задача", title: "Покупатель опциона на продажу. Размер убытка", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Убыток покупателя опционов на продажу",
    choices: ["не ограничен", "ограничен"],
    answers: ["ограничен"]
  },

  {
    header: "Типовая задача", title: "Покупатель опциона на продажу. Хеджирование кредитной сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Покупатель опционов на продажу валюты хеджирует",
    choices: ["получение кредитов в валюте", "выдачу кредитов в валюте"],
    answers: ["выдачу кредитов в валюте"]
  },

  {
    header: "Типовая задача", title: "Покупатель опциона на продажу. Хеджирование внешнеторговой сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Покупатель опционов на продажу валюты хеджирует",
    choices: ["импорт с отсрочкой платежа", "экспорт с отсрочкой платежа"],
    answers: ["экспорт с отсрочкой платежа"]
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат покупателя опциона на продажу 1", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Приобрели опцион на продажу по 4 RUB за каждый USD контракта. Цена по опциону 77 руб. Найти финансовый результат покупателя опциона в млн. руб при курсе USD {=77-{var1-10}} руб в июне",
    answer: "{var1-10}-4"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат покупателя опциона на продажу 2", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Приобрели опцион на продажу по {={var1-10}/2} RUB за каждый USD контракта. Цена по опциону 77 руб. Найти финансовый результат покупателя опциона в млн. руб при курсе USD {=77+{var1-10}} руб в июне",
    answer: "-{var1-10}/2"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат покупателя опциона на продажу 3", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Приобрели опцион на продажу по 5 RUB за каждый USD контракта. Цена по опциону 80 руб. Найти финансовый результат покупателя опциона в млн. руб при курсе USD {=80-{var1-10}/2} руб в июне",
    answer: "{var1-10}/2-5"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат покупателя опциона на продажу. Безубыточность", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Приобрели опцион на продажу по {={var1-10}/2} RUB за каждый USD контракта. Цена по опциону 77 руб. Найти курс USD при нулевом финансовом результате",
    answer: "77-{var1-10}/2"
  }
]

const call_option_seller = [
  {
    header: "Типовая задача", title: "Продавец опциона на покупку. Тренд", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Продавец опциона на покупку рассчитывает на...",
    choices: ["медвежий тренд", "бычий тренд"],
    answers: ["медвежий тренд"],
    imageurl: "/bullbear.jpg"
  },

  {
    header: "Типовая задача", title: "Продавец опциона на покупку. Размер прибыли", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Прибыль продавца опционов на покупку",
    choices: ["ограничена", "не ограничена"],
    answers: ["ограничена"]
  },

  {
    header: "Типовая задача", title: "Продавец опциона на покупку. Размер убытков", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Убыток продавца опционов на покупку",
    choices: ["не ограничен", "ограничен"],
    answers: ["не ограничен"]
  },

  {
    header: "Типовая задача", title: "Продавец опциона на покупку. Хеджирование внешнеторговой сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Продавец опциона на покупку валюты хеджирует",
    choices: ["импорт с отсрочкой платежа", "экспорт с отсрочкой платежа"],
    answers: ["экспорт с отсрочкой платежа"]
  },

  {
    header: "Типовая задача", title: "Продавец опциона на покупку. Хеджирование кредитной сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Продавец опциона на покупку валюты хеджирует",
    choices: ["выдачу кредитов в валюте", "получение кредитов в валюте"],
    answers: ["выдачу кредитов в валюте"]
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат продавца опциона на покупку 1", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Продали опцион на покупку по 4 RUB за каждый USD контракта. Цена по опциону 77 руб. Найти финансовый результат продавца опциона в млн. руб при курсе USD {=81+{var1-10}} руб в июне",
    answer: "-{var1-10}"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат продавца опциона на покупку 2", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Продали опцион на покупку по {={var1-10}/2} RUB за каждый USD контракта. Цена по опциону 77 руб. Найти финансовый результат продавца опциона в млн. руб при курсе USD {=77-{var1-10}} руб в июне",
    answer: "{var1-10}/2"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат продавца опциона на покупку 3", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Продали опцион на покупку по 5 RUB за каждый USD контракта. Цена по опциону 80 руб. Найти финансовый результат продавца опциона в млн. руб при курсе USD {=80+{var1-10}/2} руб в июне",
    answer: "5-{var1-10}/2"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат продавца опциона на покупку. Безубыточность", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Продали опцион на покупку по {={var1-10}/2} RUB за каждый USD контракта. Цена по опциону 77 руб. Найти курс USD при нулевом финансовом результате",
    answer: "77+{var1-10}/2"
  }
]


const call_option_holder = [
  {
    header: "Типовая задача", title: "Покупатель опциона на покупку. Тренд", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Покупатель опциона на покупку рассчитывает на...",
    choices: ["медвежий тренд", "бычий тренд"],
    answers: ["бычий тренд"],
    imageurl: "/bullbear.jpg"
  },

  {
    header: "Типовая задача", title: "Покупатель опциона на покупку. Размер прибыли", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Прибыль покупателя опционов на покупку",
    choices: ["ограничена", "не ограничена"],
    answers: ["не ограничена"]
  },

  {
    header: "Типовая задача", title: "Покупатель опциона на покупку. Размер убытка", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Убыток покупателя опционов на покупку",
    choices: ["не ограничен", "ограничен"],
    answers: ["ограничен"]
  },

  {
    header: "Типовая задача", title: "Покупатель опциона на покупку. Хеджирование внешнеторговой сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Покупатель опционов на покупку валюты хеджирует",
    choices: ["импорт с отсрочкой платежа", "экспорт с отсрочкой платежа"],
    answers: ["импорт с отсрочкой платежа"]
  },

  {
    header: "Типовая задача", title: "Покупатель опциона на покупку. Хеджирование кредитной сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Покупатель опционов на покупку валюты хеджирует",
    choices: ["выдачу кредитов в валюте", "получение кредитов в валюте"],
    answers: ["получение кредитов в валюте"]
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат покупателя опциона на покупку 1", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Приобрели опцион на покупку по 4 RUB за каждый USD контракта. Цена по опциону 77 руб. Найти финансовый результат покупателя опциона в млн. руб при курсе USD {=81+{var1-10}} руб в июне",
    answer: "{var1-10}"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат покупателя опциона на покупку 2", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Приобрели опцион на покупку по {={var1-10}/2} RUB за каждый USD контракта. Цена по опциону 77 руб. Найти финансовый результат покупателя опциона в млн. руб при курсе USD {=77-{var1-10}} руб в июне",
    answer: "-{var1-10}/2"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат покупателя опциона на покупку 3", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Приобрели опцион на покупку по 5 RUB за каждый USD контракта. Цена по опциону 80 руб. Найти финансовый результат покупателя опциона в млн. руб при курсе USD {=80+{var1-10}/2} руб в июне",
    answer: "{var1-10}/2-5"
  },

  {
    header: "Типовая задача", title: "Расчет Финансовый результат покупателя опциона на покупку. Безубыточность", theme: "Финансовый инжиниринг. Хеджирование",
    text: "В ноябре заключен опционный контракт на $1 млн. Приобрели опцион на покупку по {={var1-10}/2} RUB за каждый USD контракта. Цена по опциону 77 руб. Найти курс USD при нулевом финансовом результате",
    answer: "77+{var1-10}/2"
  }
]

const forwards_futures = [
  {
    header: "Типовая задача", title: "Покупатель фьючерсов. Тренд", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Покупка фьючерсов применяется спекулянтами в расчете на...",
    choices: ["медвежий тренд", "бычий тренд"],
    answers: ["бычий тренд"],
    imageurl: "/bullbear.jpg"
  },

  {
    header: "Типовая задача", title: "Покупатель фьючерсов. Хеджирование внешнеторговой сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Покупка фьючерсов по долларам позволяет хеджировать",
    choices: ["экспорт с отсрочкой платежа", "импорт с отсрочкой платежа"],
    answers: ["импорт с отсрочкой платежа"]
  },

  {
    header: "Типовая задача", title: "Покупатель фьючерсов. Хеджирование кредитной сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Покупка фьючерсов по долларам позволяет хеджировать операции",
    choices: ["получения кредитов в валюте", "выдачу кредитов в валюте"],
    answers: ["получения кредитов в валюте"]
  },


  {
    header: "Типовая задача", title: "Продавец фьючерсов. Тренд", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Продажа фьючерсов применяется спекулянтами в расчете на...",
    choices: ["медвежий тренд", "бычий тренд"],
    answers: ["медвежий тренд"],
    imageurl: "/bullbear.jpg"
  },

  {
    header: "Типовая задача", title: "Продавец фьючерсов. Хеджирование кредитной сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Продажа фьючерсов по долларам позволяет хеджировать операции",
    choices: ["получения кредитов в валюте", "выдачу кредитов в валюте"],
    answers: ["выдачу кредитов в валюте"]
  },


  {
    header: "Типовая задача", title: "Продавец фьючерсов. Хеджирование внешнеторговой сделки", theme: "Финансовый инжиниринг. Хеджирование",
    text: "Продажа фьючерсов по долларам позволяет хеджировать",
    choices: ["импорт с отсрочкой платежа", "экспорт с отсрочкой платежа"],
    answers: ["экспорт с отсрочкой платежа"]
  },

  {
    header: "Типовая задача", title: "Хеджирование рисков инвестиционного проекта", theme: "Финансовый инжиниринг. Хеджирование",
    text: `Предприниматель планирует купить через 6 мес. оборудование на сумму $1 млн USD, но опасается, что его стоимость к этому моменту вырастет. 
      Для хеджирования данного риска покупает форвардный контракт с поставкой через 6 мес. 
      Курс на момент заключения договора 75 руб. Курс на момент поставки товара {={var1-10}+75} руб. 
      Определить влияние изменения курса на финансовый результат по ОСНОВНОЙ СДЕЛКЕ в млн. руб?`,
    answer: "-{var1-10}"
  },

  {
    header: "Типовая задача", title: "Хеджирование рисков покупки импортного оборудования", theme: "Финансовый инжиниринг. Хеджирование",
    text: `Предприниматель планирует купить через 6 мес. оборудование на сумму $1 млн USD, но опасается, что его стоимость к этому моменту вырастет. 
      Для хеджирования данного риска покупает форвардный контракт с поставкой через 6 мес. 
      Курс на момент заключения договора 75 руб. Курс на момент поставки товара {={var1-10}+75} руб. 
      Определить финансовый результат по ФОРВАРДУ в млн. руб?`,
    answer: "{var1-10}"
  }

]

const risk_return = [
  {
    header: "Типовая задача", title: "Банк. Безрисковая доходность", theme: "Оценка рисков",
    text: "Банк привлек средства - {=200+{var1-10}*100} млрд руб - на депозит под {=4+{var1-10}/5}% и разместил их в кредитах. Операционные расходы банка {={var1-10}*5} млрд руб. Банк должен получить прибыль 10 млрд руб. Процент по кредитам должен составить... % годовых.",
    answer: "((2+{var1-10})*(4+{var1-10}/5)+{var1-10}*5+10)*100/(200+{var1-10}*100)"
  },

  {
    header: "Типовая задача", title: "Банк. Процентный риск", theme: "Оценка рисков",
    text: "Банк привлек средства - {=200+{var1-10}*100} млрд руб - на депозит под {=4+{var1-10}/5}% и разместил их в кредитах. Операционные расходы банка {={var1-10}*5} млрд руб. Банк должен получить прибыль 10 млрд руб. Ожидается, что {=10-{var1-10}/2}% кредитов не принесет процентный доход, но основная сумма долга будет возвращена. Процент по кредитам должен составить... % годовых.",
    answer: "((2+{var1-10})*(4+{var1-10}/5)+{var1-10}*5+10)*100/((2+{var1-10})*(100-(10-{var1-10}/2)))"
  },

  {
    header: "Типовая задача", title: "Банк. Кредитный риск", theme: "Оценка рисков",
    text: "Банк привлек средства - {=200+{var1-10}*100} млрд руб - на депозит под {=4+{var1-10}/5}% и разместил их в кредитах. Операционные расходы банка {={var1-10}*5} млрд руб. Банк должен получить прибыль 10 млрд руб. Ожидается, что {=10-{var1-10}/2}% кредитов не принесет процентный доход, а сумма долга в {={var1-10}/3}% выданных кредитов вообще не будет возвращена. Процент по кредитам должен составить... % годовых.",
    answer: "((2+{var1-10})*(4+{var1-10}/5+{var1-10}/3)+{var1-10}*5+10)*100/((2+{var1-10})*(100-(10-{var1-10}/2)))"
  }
]



const business_budgeting = [
  {
    header: "Типовая задача", title: "Покупка материалов у поставщиков", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при покупке материалов у поставщиков?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, П+X"]
  },

  {
    header: "Типовая задача", title: "Передача материалов в производство", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при передаче материалов в производство?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, А-Х"]
  },

  {
    header: "Типовая задача", title: "Передача на склад готовой продукции", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при передаче на склад готовой продукции?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, А-Х"]
  },

  {
    header: "Типовая задача", title: "Списание со склада готовой продукции при продаже", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при списании со склада готовой продукции при продаже?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А-Х, П-Х"]
  },

  {
    header: "Типовая задача", title: "Начисление задолженности покупателя на момент продажи (признании выручки)", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при начислении задолженности покупателя на момент продажи (признании выручки)?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, П+X"]
  },

  {
    header: "Типовая задача", title: "Поступление денежных средств на расчетный счет от покупателя в счет ранее выполненной продажи", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при поступлении денежных средств на расчетный счет от покупателя в счет ранее выполненной продажи?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, А-Х"]
  },

  {
    header: "Типовая задача", title: "Перечисление денежных средств с расчетного счета поставщикам в счет ранее полученных ценностей", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при перечислении денежных средств с расчетного счета поставщикам?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А-Х, П-Х"]
  },

  {
    header: "Типовая задача", title: "Начисление заработной платы основным производственным рабочим", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при начислении заработной платы основным производственным рабочим?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, П+X"]
  },

  {
    header: "Типовая задача", title: "Начисление взносов по социальному страхованию", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при начислении взносов по социальному страхованию?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, П+X"]
  },

  {
    header: "Типовая задача", title: "Уплата налога в бюджет с расчетного счета", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при уплате налога в бюджет с расчетного счета?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А-Х, П-Х"]
  },

  {
    header: "Типовая задача", title: "Уплата социальных взносов с расчетного счета", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при уплате социальных взносов с расчетного счета?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А-Х, П-Х"]
  },

  {
    header: "Типовая задача", title: "Начисление (удержание) налога на доходы физических лиц", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при начислении (удержании) налога на доходы физических лиц?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["П+Х, П-Х"]
  },

  {
    header: "Типовая задача", title: "Получение денежных средств в кассу с расчетного счета", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при получении денежных средств в кассу с расчетного счета?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, А-Х"]
  },

  {
    header: "Типовая задача", title: "Выплата заработной платы из кассы", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при выплате заработной платы из кассы?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А-Х, П-Х"]
  },

  {
    header: "Типовая задача", title: "Формирование уставного капитала", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при формировании уставного капитала?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, П+X"]
  },

  {
    header: "Типовая задача", title: "Взнос учредителем денежных средств в кассу", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при взносе учредителем денежных средств в кассу?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, А-Х"]
  },

  {
    header: "Типовая задача", title: "Получение краткосрочного кредита на расчетный счет", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при получении краткосрочного кредита на расчетный счет?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А+Х, П+X"]
  },

  {
    header: "Типовая задача", title: "Начисление процентов по кредиту", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при начислении процентов по кредиту?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["П+Х, П-Х"]
  },

  {
    header: "Типовая задача", title: "Уплата процентов по кредиту и погашение основной суммы долга", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при уплате процентов по кредиту и погашении основной суммы долга?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["А-Х, П-Х"]
  },

  {
    header: "Типовая задача", title: "Начисление дивидендов акционерам", theme: "Планирование и бюджетирование",
    text: "Как изменяется баланс при начислении дивидендов акционерам?",
    choices: ["А+Х, А-Х", "А+Х, П+X", "А-Х, П-Х", "П+Х, П-Х"],
    answers: ["П+Х, П-Х"]
  }
];

export {
  accounting101, beta_abstract_cases, balance_advanced_financial_ratios_cases, balance_financial_solvency_analysis_cases, balance_financial_ratios_cases,
  margin_leverages_cases, balance_sheet_financials, simple_accounting, stop_orders, put_option_seller, put_option_holder,
  call_option_seller, call_option_holder, forwards_futures, business_budgeting, risk_return, statistics
};