let balanceContoArray = [
    { id: "Основные средства", children: ["01", "08", "07", "04", "02"] },
    { id: "Материалы", children: ["10", "14", "15", "16", "19"] },
    { id: "Незавершенное производство", children: ["20", "23", "25", "26", "44", "21"] },
    { id: "Готовая продукция", children: ["41", "43"] },
    { id: "Дебиторская задолженность", children: ["62.1", "60.2", "75.1", "76", "68"] },
    { id: "Деньги", children: ["50", "51", "52", "55"] },
    { id: "Уставный капитал", children: ["80", "82", "83", "81"] },
    { id: "Нераспределенная прибыль", children: ["84", "90.1", "90.2", "90.3", "90.4", "90.5", "90.9", "91.1", "91.2", "91.9", "99"] },
    { id: "Долгосрочный банковский кредит", children: ["67"] },
    { id: "Краткосрочный банковский кредит", children: ["66"] },
    { id: "Кредиторская задолженность", children: ["70", "62.2", "60.1", "68", "75.2", "76", "69"] },
]


export default balanceContoArray